{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "%%capture\n",
    "import sys\n",
    "!{sys.executable} -m pip install py2neo;\n",
    "import py2neo\n",
    "import pandas as pd\n",
    "from collections import defaultdict"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph = py2neo.Graph('http://neo4j:7474')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# New York Times Comments\n",
    "The data contains information about the comments made on the articles published in New York Times in Jan-May 2017 and Jan-April 2018.\n",
    "\n",
    "See: https://www.kaggle.com/aashita/nyt-comments/home"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Data Summary"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Label</th>\n",
       "      <th>N</th>\n",
       "      <th>Avg. Degree</th>\n",
       "      <th>Std. Dev. Degree</th>\n",
       "      <th>Median Degree</th>\n",
       "      <th>Min. Degree</th>\n",
       "      <th>Max. Degree</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[ARTICLE]</td>\n",
       "      <td>9298</td>\n",
       "      <td>185.409228</td>\n",
       "      <td>315.736664</td>\n",
       "      <td>57.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>4996.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[USER]</td>\n",
       "      <td>301682</td>\n",
       "      <td>5.714411</td>\n",
       "      <td>21.186375</td>\n",
       "      <td>1.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>1571.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[COMMENTED]</td>\n",
       "      <td>1723935</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "         Label        N  Avg. Degree  Std. Dev. Degree  Median Degree  \\\n",
       "0    [ARTICLE]     9298   185.409228        315.736664           57.0   \n",
       "1       [USER]   301682     5.714411         21.186375            1.0   \n",
       "2  [COMMENTED]  1723935          NaN               NaN            NaN   \n",
       "\n",
       "   Min. Degree  Max. Degree  \n",
       "0          1.0       4996.0  \n",
       "1          0.0       1571.0  \n",
       "2          NaN          NaN  "
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def yield_record(cursor):\n",
    "    halt = False\n",
    "    while not halt:\n",
    "        try:\n",
    "            yield cur.next().data()\n",
    "        except:\n",
    "            halt = True\n",
    "            \n",
    "Ncomments = graph.run(\"\"\"MATCH ()-[r:COMMENTED]->() RETURN count(*)\"\"\").next().data()['count(*)']\n",
    "            \n",
    "cur = graph.run(\"\"\"MATCH (n)\n",
    "RETURN\n",
    "DISTINCT labels(n),\n",
    "count(*) AS nNodes,\n",
    "avg(size( (n)-[]-() ) ) as avgDeg,\n",
    "stdev(size( (n)-[]-() ) ) as stdDeg,\n",
    "percentileDisc(size( (n)-[]-() ), 0.5) as medDeg, \n",
    "min(size( (n)-[]-() ) ) as minDeg,\n",
    "max(size( (n)-[]-() ) ) as maxDeg\"\"\")\n",
    "\n",
    "pd.DataFrame(\n",
    "    [list(record.values()) for record in yield_record(cur)] + [[['COMMENTED'], Ncomments]], \n",
    "    columns=['Label', 'N', 'Avg. Degree', 'Std. Dev. Degree', 'Median Degree', 'Min. Degree', 'Max. Degree']\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### What articles have the highest degree (i.e., most comments)?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<style  type=\"text/css\" >\n",
       "</style>  \n",
       "<table id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004\" > \n",
       "<thead>    <tr> \n",
       "        <th class=\"blank level0\" ></th> \n",
       "        <th class=\"col_heading level0 col0\" >Comments</th> \n",
       "        <th class=\"col_heading level0 col1\" >byline</th> \n",
       "        <th class=\"col_heading level0 col2\" >connComponent</th> \n",
       "        <th class=\"col_heading level0 col3\" >headline</th> \n",
       "        <th class=\"col_heading level0 col4\" >newDesk</th> \n",
       "        <th class=\"col_heading level0 col5\" >pagerank</th> \n",
       "        <th class=\"col_heading level0 col6\" >pubDate</th> \n",
       "        <th class=\"col_heading level0 col7\" >webURL</th> \n",
       "    </tr>    <tr> \n",
       "        <th class=\"index_name level0\" >articleID</th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "    </tr></thead> \n",
       "<tbody>    <tr> \n",
       "        <th id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004level0_row0\" class=\"row_heading level0 row0\" >58b0894195d0e0247463875e</th> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row0_col0\" class=\"data row0 col0\" >4996</td> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row0_col1\" class=\"data row0 col1\" >By JULIE HIRSCHFELD DAVIS and MICHAEL M. GRYNBAUM</td> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row0_col2\" class=\"data row0 col2\" >159386</td> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row0_col3\" class=\"data row0 col3\" >Trump Intensifies Criticism of F.B.I. and Journalists</td> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row0_col4\" class=\"data row0 col4\" >National</td> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row0_col5\" class=\"data row0 col5\" >195.696</td> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row0_col6\" class=\"data row0 col6\" >2017-02-24 19:27:53</td> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row0_col7\" class=\"data row0 col7\" ><a target=\"_blank\" href=\"https://www.nytimes.com/2017/02/24/us/politics/white-house-sean-spicer-briefing.html\"\">Link</a></td> \n",
       "    </tr>    <tr> \n",
       "        <th id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004level0_row1\" class=\"row_heading level0 row1\" >5912391b7c459f24986de9ab</th> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row1_col0\" class=\"data row1 col0\" >4184</td> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row1_col1\" class=\"data row1 col1\" >By MICHAEL D. SHEAR and MATT APUZZO</td> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row1_col2\" class=\"data row1 col2\" >167890</td> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row1_col3\" class=\"data row1 col3\" >Trump Fires Comey Amid Russia Inquiry</td> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row1_col4\" class=\"data row1 col4\" >National</td> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row1_col5\" class=\"data row1 col5\" >157.107</td> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row1_col6\" class=\"data row1 col6\" >2017-05-09 21:48:03</td> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row1_col7\" class=\"data row1 col7\" ><a target=\"_blank\" href=\"https://www.nytimes.com/2017/05/09/us/politics/james-comey-fired-fbi.html\"\">Link</a></td> \n",
       "    </tr>    <tr> \n",
       "        <th id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004level0_row2\" class=\"row_heading level0 row2\" >58ebb1437c459f24986d96ed</th> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row2_col0\" class=\"data row2 col0\" >4014</td> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row2_col1\" class=\"data row2 col1\" >By DANIEL VICTOR and MATT STEVENS</td> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row2_col2\" class=\"data row2 col2\" >167890</td> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row2_col3\" class=\"data row2 col3\" >Man Is Dragged From a Full Jet, Stirring a Furor</td> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row2_col4\" class=\"data row2 col4\" >Business</td> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row2_col5\" class=\"data row2 col5\" >239.803</td> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row2_col6\" class=\"data row2 col6\" >2017-04-10 16:22:22</td> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row2_col7\" class=\"data row2 col7\" ><a target=\"_blank\" href=\"https://www.nytimes.com/2017/04/10/business/united-flight-passenger-dragged.html\"\">Link</a></td> \n",
       "    </tr>    <tr> \n",
       "        <th id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004level0_row3\" class=\"row_heading level0 row3\" >591a524d7c459f24986dfc28</th> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row3_col0\" class=\"data row3 col0\" >3791</td> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row3_col1\" class=\"data row3 col1\" >By DAVID BROOKS</td> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row3_col2\" class=\"data row3 col2\" >167890</td> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row3_col3\" class=\"data row3 col3\" >When a Child Is Leading The World</td> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row3_col4\" class=\"data row3 col4\" >OpEd</td> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row3_col5\" class=\"data row3 col5\" >165.153</td> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row3_col6\" class=\"data row3 col6\" >2017-05-16 01:13:44</td> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row3_col7\" class=\"data row3 col7\" ><a target=\"_blank\" href=\"https://www.nytimes.com/2017/05/15/opinion/trump-classified-data.html\"\">Link</a></td> \n",
       "    </tr>    <tr> \n",
       "        <th id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004level0_row4\" class=\"row_heading level0 row4\" >5930616f7c459f24986e2e41</th> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row4_col0\" class=\"data row4 col0\" >3709</td> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row4_col1\" class=\"data row4 col1\" >By MICHAEL D. SHEAR</td> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row4_col2\" class=\"data row4 col2\" >167890</td> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row4_col3\" class=\"data row4 col3\" >Trump Abandoning Global Climate Accord</td> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row4_col4\" class=\"data row4 col4\" >Foreign</td> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row4_col5\" class=\"data row4 col5\" >171.479</td> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row4_col6\" class=\"data row4 col6\" >2017-06-01 18:48:08</td> \n",
       "        <td id=\"T_a05076aa_26a0_11e9_a6e0_0242ac120004row4_col7\" class=\"data row4 col7\" ><a target=\"_blank\" href=\"https://www.nytimes.com/2017/06/01/climate/trump-paris-climate-agreement.html\"\">Link</a></td> \n",
       "    </tr></tbody> \n",
       "</table> "
      ],
      "text/plain": [
       "<pandas.io.formats.style.Styler at 0x7fd2c2ce29b0>"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cur = graph.run(\"\"\"MATCH (a:ARTICLE)\n",
    "WITH a, SIZE(()-[:COMMENTED]->(a)) as cmtCnt\n",
    "ORDER BY cmtCnt DESC LIMIT 5\n",
    "MATCH p=()-[:COMMENTED]->(a)\n",
    "RETURN a, count(p)\"\"\")\n",
    "\n",
    "pd.DataFrame([{**res['a'], 'Comments': res['count(p)']} for res in yield_record(cur)]) \\\n",
    "    .sort_values('Comments', ascending=False) \\\n",
    "    .set_index('articleID') \\\n",
    "    .style.format({'webURL': lambda x: f'<a target=\"_blank\" href=\"{x}\"\">Link</a>'})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### What users have the highest degree (i.e., most comments)?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Comments</th>\n",
       "      <th>connComponent</th>\n",
       "      <th>pagerank</th>\n",
       "      <th>userDisplayName</th>\n",
       "      <th>userLocation</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>userID</th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>61986282.0</th>\n",
       "      <td>1571</td>\n",
       "      <td>159386</td>\n",
       "      <td>0.15</td>\n",
       "      <td>Phyliss Dalmatian</td>\n",
       "      <td>Wichita, Kansas</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17374907.0</th>\n",
       "      <td>1235</td>\n",
       "      <td>159386</td>\n",
       "      <td>0.15</td>\n",
       "      <td>Blackmamba</td>\n",
       "      <td>Il</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47123844.0</th>\n",
       "      <td>1232</td>\n",
       "      <td>159386</td>\n",
       "      <td>0.15</td>\n",
       "      <td>Richard Luettgen</td>\n",
       "      <td>New Jersey</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47112177.0</th>\n",
       "      <td>1174</td>\n",
       "      <td>159386</td>\n",
       "      <td>0.15</td>\n",
       "      <td>manfred m</td>\n",
       "      <td>Bolivia</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37475504.0</th>\n",
       "      <td>1157</td>\n",
       "      <td>159386</td>\n",
       "      <td>0.15</td>\n",
       "      <td>John Doe</td>\n",
       "      <td>Johnstown</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "            Comments  connComponent  pagerank    userDisplayName  \\\n",
       "userID                                                             \n",
       "61986282.0      1571         159386      0.15  Phyliss Dalmatian   \n",
       "17374907.0      1235         159386      0.15         Blackmamba   \n",
       "47123844.0      1232         159386      0.15   Richard Luettgen   \n",
       "47112177.0      1174         159386      0.15          manfred m   \n",
       "37475504.0      1157         159386      0.15           John Doe   \n",
       "\n",
       "               userLocation  \n",
       "userID                       \n",
       "61986282.0  Wichita, Kansas  \n",
       "17374907.0               Il  \n",
       "47123844.0       New Jersey  \n",
       "47112177.0          Bolivia  \n",
       "37475504.0        Johnstown  "
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cur = graph.run(\"\"\"MATCH (u:USER)\n",
    "WITH u, SIZE((u)-[:COMMENTED]->()) as cmtCnt\n",
    "ORDER BY cmtCnt DESC LIMIT 5\n",
    "MATCH p=(u)-[:COMMENTED]->()\n",
    "RETURN u, count(p)\"\"\")\n",
    "\n",
    "pd.DataFrame([{**res['u'], 'Comments': res['count(p)']} for res in yield_record(cur)]) \\\n",
    "    .sort_values('Comments', ascending=False) \\\n",
    "    .set_index('userID')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## How many subgraphs are there?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Subgraphs: 2369\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nNodes</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>partition</th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>159386</th>\n",
       "      <td>208774</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>167890</th>\n",
       "      <td>99666</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>150435</th>\n",
       "      <td>13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>190309</th>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>217346</th>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "           nNodes\n",
       "partition        \n",
       "159386     208774\n",
       "167890      99666\n",
       "150435         13\n",
       "190309          6\n",
       "217346          6"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "op = \"\"\"MATCH (n) RETURN distinct(n.connComponent) as partition, count(*) as nNodes ORDER by nNodes DESC\"\"\"\n",
    "cur = graph.run(op)\n",
    "records = list(yield_record(cur))\n",
    "print('Subgraphs: {}'.format(len(records)))\n",
    "df = pd.DataFrame(records).set_index('partition')\n",
    "df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "35"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "(df.nNodes > 2).sum()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [],
   "source": [
    "partitions = {}\n",
    "for idx in df[df.nNodes > 1].index:\n",
    "    op = \"MATCH (n) WHERE n.connComponent = {} RETURN collect(n.newDesk)\".format(idx)\n",
    "    cur = graph.run(op)\n",
    "    value_counts = defaultdict(int)\n",
    "    for ii in cur.next().data()['collect(n.newDesk)']:\n",
    "        value_counts[ii] += 1\n",
    "    partitions[idx] = dict(value_counts)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 60,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Arts&amp;Leisure</th>\n",
       "      <th>Automobiles</th>\n",
       "      <th>BookReview</th>\n",
       "      <th>Business</th>\n",
       "      <th>Climate</th>\n",
       "      <th>Culture</th>\n",
       "      <th>Dining</th>\n",
       "      <th>EdLife</th>\n",
       "      <th>Editorial</th>\n",
       "      <th>Express</th>\n",
       "      <th>Foreign</th>\n",
       "      <th>Games</th>\n",
       "      <th>Insider</th>\n",
       "      <th>Investigative</th>\n",
       "      <th>Learning</th>\n",
       "      <th>Letters</th>\n",
       "      <th>Magazine</th>\n",
       "      <th>Metro</th>\n",
       "      <th>Metropolitan</th>\n",
       "      <th>NYTNow</th>\n",
       "      <th>National</th>\n",
       "      <th>NewsDesk</th>\n",
       "      <th>Obits</th>\n",
       "      <th>OpEd</th>\n",
       "      <th>Photo</th>\n",
       "      <th>Podcasts</th>\n",
       "      <th>Politics</th>\n",
       "      <th>RealEstate</th>\n",
       "      <th>Science</th>\n",
       "      <th>Smarter Living</th>\n",
       "      <th>Society</th>\n",
       "      <th>SpecialSections</th>\n",
       "      <th>Sports</th>\n",
       "      <th>Styles</th>\n",
       "      <th>Summary</th>\n",
       "      <th>SundayBusiness</th>\n",
       "      <th>TStyle</th>\n",
       "      <th>Travel</th>\n",
       "      <th>Unknown</th>\n",
       "      <th>Upshot</th>\n",
       "      <th>Video</th>\n",
       "      <th>Washington</th>\n",
       "      <th>Weekend</th>\n",
       "      <th>Well</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.008978</td>\n",
       "      <td>NaN</td>\n",
       "      <td>0.007074</td>\n",
       "      <td>0.047885</td>\n",
       "      <td>0.004217</td>\n",
       "      <td>0.052510</td>\n",
       "      <td>0.038090</td>\n",
       "      <td>0.000816</td>\n",
       "      <td>0.031560</td>\n",
       "      <td>0.002585</td>\n",
       "      <td>0.052782</td>\n",
       "      <td>0.038226</td>\n",
       "      <td>0.014692</td>\n",
       "      <td>0.003673</td>\n",
       "      <td>0.059312</td>\n",
       "      <td>0.000544</td>\n",
       "      <td>0.037274</td>\n",
       "      <td>0.064889</td>\n",
       "      <td>0.006122</td>\n",
       "      <td>0.000544</td>\n",
       "      <td>0.067610</td>\n",
       "      <td>0.003945</td>\n",
       "      <td>0.002993</td>\n",
       "      <td>0.181608</td>\n",
       "      <td>0.005169</td>\n",
       "      <td>0.003537</td>\n",
       "      <td>0.002993</td>\n",
       "      <td>0.026391</td>\n",
       "      <td>0.030880</td>\n",
       "      <td>0.004217</td>\n",
       "      <td>0.000272</td>\n",
       "      <td>0.002449</td>\n",
       "      <td>0.032104</td>\n",
       "      <td>0.007074</td>\n",
       "      <td>0.000408</td>\n",
       "      <td>0.006122</td>\n",
       "      <td>0.001905</td>\n",
       "      <td>0.012379</td>\n",
       "      <td>0.009795</td>\n",
       "      <td>0.022854</td>\n",
       "      <td>0.000408</td>\n",
       "      <td>0.051422</td>\n",
       "      <td>0.014284</td>\n",
       "      <td>0.037410</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>0.002728</td>\n",
       "      <td>0.000546</td>\n",
       "      <td>0.005456</td>\n",
       "      <td>0.029460</td>\n",
       "      <td>NaN</td>\n",
       "      <td>0.057283</td>\n",
       "      <td>0.045827</td>\n",
       "      <td>0.002728</td>\n",
       "      <td>0.052373</td>\n",
       "      <td>NaN</td>\n",
       "      <td>0.065466</td>\n",
       "      <td>0.039825</td>\n",
       "      <td>0.024550</td>\n",
       "      <td>NaN</td>\n",
       "      <td>0.049645</td>\n",
       "      <td>0.000546</td>\n",
       "      <td>0.060011</td>\n",
       "      <td>0.062739</td>\n",
       "      <td>0.006547</td>\n",
       "      <td>NaN</td>\n",
       "      <td>0.072013</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>0.200764</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>0.014730</td>\n",
       "      <td>0.031097</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>0.050736</td>\n",
       "      <td>0.003819</td>\n",
       "      <td>0.000546</td>\n",
       "      <td>0.006547</td>\n",
       "      <td>NaN</td>\n",
       "      <td>0.010911</td>\n",
       "      <td>0.016912</td>\n",
       "      <td>0.033279</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>0.016912</td>\n",
       "      <td>0.036007</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   Arts&Leisure  Automobiles  BookReview  Business   Climate   Culture  \\\n",
       "0      0.008978          NaN    0.007074  0.047885  0.004217  0.052510   \n",
       "1      0.002728     0.000546    0.005456  0.029460       NaN  0.057283   \n",
       "2           NaN          NaN         NaN       NaN       NaN       NaN   \n",
       "3           NaN          NaN         NaN       NaN       NaN       NaN   \n",
       "4           NaN          NaN         NaN       NaN       NaN       NaN   \n",
       "\n",
       "     Dining    EdLife  Editorial   Express   Foreign     Games   Insider  \\\n",
       "0  0.038090  0.000816   0.031560  0.002585  0.052782  0.038226  0.014692   \n",
       "1  0.045827  0.002728   0.052373       NaN  0.065466  0.039825  0.024550   \n",
       "2       NaN       NaN        NaN       NaN       NaN       NaN       NaN   \n",
       "3       NaN       NaN        NaN       NaN       NaN       NaN  1.000000   \n",
       "4       NaN       NaN        NaN       NaN       NaN       NaN       NaN   \n",
       "\n",
       "   Investigative  Learning   Letters  Magazine     Metro  Metropolitan  \\\n",
       "0       0.003673  0.059312  0.000544  0.037274  0.064889      0.006122   \n",
       "1            NaN  0.049645  0.000546  0.060011  0.062739      0.006547   \n",
       "2            NaN  1.000000       NaN       NaN       NaN           NaN   \n",
       "3            NaN       NaN       NaN       NaN       NaN           NaN   \n",
       "4            NaN  1.000000       NaN       NaN       NaN           NaN   \n",
       "\n",
       "     NYTNow  National  NewsDesk     Obits      OpEd     Photo  Podcasts  \\\n",
       "0  0.000544  0.067610  0.003945  0.002993  0.181608  0.005169  0.003537   \n",
       "1       NaN  0.072013       NaN       NaN  0.200764       NaN       NaN   \n",
       "2       NaN       NaN       NaN       NaN       NaN       NaN       NaN   \n",
       "3       NaN       NaN       NaN       NaN       NaN       NaN       NaN   \n",
       "4       NaN       NaN       NaN       NaN       NaN       NaN       NaN   \n",
       "\n",
       "   Politics  RealEstate   Science  Smarter Living   Society  SpecialSections  \\\n",
       "0  0.002993    0.026391  0.030880        0.004217  0.000272         0.002449   \n",
       "1       NaN    0.014730  0.031097             NaN       NaN              NaN   \n",
       "2       NaN         NaN       NaN             NaN       NaN              NaN   \n",
       "3       NaN         NaN       NaN             NaN       NaN              NaN   \n",
       "4       NaN         NaN       NaN             NaN       NaN              NaN   \n",
       "\n",
       "     Sports    Styles   Summary  SundayBusiness    TStyle    Travel   Unknown  \\\n",
       "0  0.032104  0.007074  0.000408        0.006122  0.001905  0.012379  0.009795   \n",
       "1  0.050736  0.003819  0.000546        0.006547       NaN  0.010911  0.016912   \n",
       "2       NaN       NaN       NaN             NaN       NaN       NaN       NaN   \n",
       "3       NaN       NaN       NaN             NaN       NaN       NaN       NaN   \n",
       "4       NaN       NaN       NaN             NaN       NaN       NaN       NaN   \n",
       "\n",
       "     Upshot     Video  Washington   Weekend      Well  \n",
       "0  0.022854  0.000408    0.051422  0.014284  0.037410  \n",
       "1  0.033279       NaN         NaN  0.016912  0.036007  \n",
       "2       NaN       NaN         NaN       NaN       NaN  \n",
       "3       NaN       NaN         NaN       NaN       NaN  \n",
       "4       NaN       NaN         NaN       NaN       NaN  "
      ]
     },
     "execution_count": 60,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "foo = pd.DataFrame([ii for ii in partitions.values()])\n",
    "bar = pd.DataFrame((foo.values / foo.sum(axis=1).values[:, None]))\n",
    "bar.columns = foo.columns\n",
    "pd.set_option('display.max_columns', 500)\n",
    "bar.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0.96413538651473352"
      ]
     },
     "execution_count": 62,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from scipy import spatial\n",
    "1 - spatial.distance.cosine(bar.iloc[0, :].fillna(0), bar.iloc[1, :].fillna(0))\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## What are the most influential articles?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<style  type=\"text/css\" >\n",
       "</style>  \n",
       "<table id=\"T_a27e2daa_26a0_11e9_a6e0_0242ac120004\" > \n",
       "<thead>    <tr> \n",
       "        <th class=\"blank level0\" ></th> \n",
       "        <th class=\"col_heading level0 col0\" >byline</th> \n",
       "        <th class=\"col_heading level0 col1\" >headline</th> \n",
       "        <th class=\"col_heading level0 col2\" >newDesk</th> \n",
       "        <th class=\"col_heading level0 col3\" >pagerank</th> \n",
       "        <th class=\"col_heading level0 col4\" >pubDate</th> \n",
       "        <th class=\"col_heading level0 col5\" >webURL</th> \n",
       "    </tr>    <tr> \n",
       "        <th class=\"index_name level0\" >articleID</th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "    </tr></thead> \n",
       "<tbody>    <tr> \n",
       "        <th id=\"T_a27e2daa_26a0_11e9_a6e0_0242ac120004level0_row0\" class=\"row_heading level0 row0\" >58e4d28e7c459f24986d87c9</th> \n",
       "        <td id=\"T_a27e2daa_26a0_11e9_a6e0_0242ac120004row0_col0\" class=\"data row0 col0\" >By KATHERINE SCHULTEN</td> \n",
       "        <td id=\"T_a27e2daa_26a0_11e9_a6e0_0242ac120004row0_col1\" class=\"data row0 col1\" >Our Eighth Annual Found Poem Student Contest</td> \n",
       "        <td id=\"T_a27e2daa_26a0_11e9_a6e0_0242ac120004row0_col2\" class=\"data row0 col2\" >Learning</td> \n",
       "        <td id=\"T_a27e2daa_26a0_11e9_a6e0_0242ac120004row0_col3\" class=\"data row0 col3\" >272.599</td> \n",
       "        <td id=\"T_a27e2daa_26a0_11e9_a6e0_0242ac120004row0_col4\" class=\"data row0 col4\" >2017-04-05 11:18:34</td> \n",
       "        <td id=\"T_a27e2daa_26a0_11e9_a6e0_0242ac120004row0_col5\" class=\"data row0 col5\" ><a target=\"_blank\" href=\"https://www.nytimes.com/2017/04/05/learning/our-eighth-annual-found-poem-student-contest.html\"\">Link</a></td> \n",
       "    </tr>    <tr> \n",
       "        <th id=\"T_a27e2daa_26a0_11e9_a6e0_0242ac120004level0_row1\" class=\"row_heading level0 row1\" >58ebb1437c459f24986d96ed</th> \n",
       "        <td id=\"T_a27e2daa_26a0_11e9_a6e0_0242ac120004row1_col0\" class=\"data row1 col0\" >By DANIEL VICTOR and MATT STEVENS</td> \n",
       "        <td id=\"T_a27e2daa_26a0_11e9_a6e0_0242ac120004row1_col1\" class=\"data row1 col1\" >Man Is Dragged From a Full Jet, Stirring a Furor</td> \n",
       "        <td id=\"T_a27e2daa_26a0_11e9_a6e0_0242ac120004row1_col2\" class=\"data row1 col2\" >Business</td> \n",
       "        <td id=\"T_a27e2daa_26a0_11e9_a6e0_0242ac120004row1_col3\" class=\"data row1 col3\" >239.803</td> \n",
       "        <td id=\"T_a27e2daa_26a0_11e9_a6e0_0242ac120004row1_col4\" class=\"data row1 col4\" >2017-04-10 16:22:22</td> \n",
       "        <td id=\"T_a27e2daa_26a0_11e9_a6e0_0242ac120004row1_col5\" class=\"data row1 col5\" ><a target=\"_blank\" href=\"https://www.nytimes.com/2017/04/10/business/united-flight-passenger-dragged.html\"\">Link</a></td> \n",
       "    </tr>    <tr> \n",
       "        <th id=\"T_a27e2daa_26a0_11e9_a6e0_0242ac120004level0_row2\" class=\"row_heading level0 row2\" >58b0894195d0e0247463875e</th> \n",
       "        <td id=\"T_a27e2daa_26a0_11e9_a6e0_0242ac120004row2_col0\" class=\"data row2 col0\" >By JULIE HIRSCHFELD DAVIS and MICHAEL M. GRYNBAUM</td> \n",
       "        <td id=\"T_a27e2daa_26a0_11e9_a6e0_0242ac120004row2_col1\" class=\"data row2 col1\" >Trump Intensifies Criticism of F.B.I. and Journalists</td> \n",
       "        <td id=\"T_a27e2daa_26a0_11e9_a6e0_0242ac120004row2_col2\" class=\"data row2 col2\" >National</td> \n",
       "        <td id=\"T_a27e2daa_26a0_11e9_a6e0_0242ac120004row2_col3\" class=\"data row2 col3\" >195.696</td> \n",
       "        <td id=\"T_a27e2daa_26a0_11e9_a6e0_0242ac120004row2_col4\" class=\"data row2 col4\" >2017-02-24 19:27:53</td> \n",
       "        <td id=\"T_a27e2daa_26a0_11e9_a6e0_0242ac120004row2_col5\" class=\"data row2 col5\" ><a target=\"_blank\" href=\"https://www.nytimes.com/2017/02/24/us/politics/white-house-sean-spicer-briefing.html\"\">Link</a></td> \n",
       "    </tr>    <tr> \n",
       "        <th id=\"T_a27e2daa_26a0_11e9_a6e0_0242ac120004level0_row3\" class=\"row_heading level0 row3\" >5930616f7c459f24986e2e41</th> \n",
       "        <td id=\"T_a27e2daa_26a0_11e9_a6e0_0242ac120004row3_col0\" class=\"data row3 col0\" >By MICHAEL D. SHEAR</td> \n",
       "        <td id=\"T_a27e2daa_26a0_11e9_a6e0_0242ac120004row3_col1\" class=\"data row3 col1\" >Trump Abandoning Global Climate Accord</td> \n",
       "        <td id=\"T_a27e2daa_26a0_11e9_a6e0_0242ac120004row3_col2\" class=\"data row3 col2\" >Foreign</td> \n",
       "        <td id=\"T_a27e2daa_26a0_11e9_a6e0_0242ac120004row3_col3\" class=\"data row3 col3\" >171.479</td> \n",
       "        <td id=\"T_a27e2daa_26a0_11e9_a6e0_0242ac120004row3_col4\" class=\"data row3 col4\" >2017-06-01 18:48:08</td> \n",
       "        <td id=\"T_a27e2daa_26a0_11e9_a6e0_0242ac120004row3_col5\" class=\"data row3 col5\" ><a target=\"_blank\" href=\"https://www.nytimes.com/2017/06/01/climate/trump-paris-climate-agreement.html\"\">Link</a></td> \n",
       "    </tr>    <tr> \n",
       "        <th id=\"T_a27e2daa_26a0_11e9_a6e0_0242ac120004level0_row4\" class=\"row_heading level0 row4\" >591a524d7c459f24986dfc28</th> \n",
       "        <td id=\"T_a27e2daa_26a0_11e9_a6e0_0242ac120004row4_col0\" class=\"data row4 col0\" >By DAVID BROOKS</td> \n",
       "        <td id=\"T_a27e2daa_26a0_11e9_a6e0_0242ac120004row4_col1\" class=\"data row4 col1\" >When a Child Is Leading The World</td> \n",
       "        <td id=\"T_a27e2daa_26a0_11e9_a6e0_0242ac120004row4_col2\" class=\"data row4 col2\" >OpEd</td> \n",
       "        <td id=\"T_a27e2daa_26a0_11e9_a6e0_0242ac120004row4_col3\" class=\"data row4 col3\" >165.153</td> \n",
       "        <td id=\"T_a27e2daa_26a0_11e9_a6e0_0242ac120004row4_col4\" class=\"data row4 col4\" >2017-05-16 01:13:44</td> \n",
       "        <td id=\"T_a27e2daa_26a0_11e9_a6e0_0242ac120004row4_col5\" class=\"data row4 col5\" ><a target=\"_blank\" href=\"https://www.nytimes.com/2017/05/15/opinion/trump-classified-data.html\"\">Link</a></td> \n",
       "    </tr></tbody> \n",
       "</table> "
      ],
      "text/plain": [
       "<pandas.io.formats.style.Styler at 0x7fd2bfacd1d0>"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cur = graph.run(\"\"\"MATCH (n:ARTICLE)\n",
    "RETURN n\n",
    "ORDER by n.pagerank\n",
    "DESC LIMIT 5\"\"\")\n",
    "pd.DataFrame([rec['n'] for rec in yield_record(cur)]) \\\n",
    "    .sort_values('pagerank', ascending=False) \\\n",
    "    .set_index('articleID') \\\n",
    "    .drop('connComponent', axis=1) \\\n",
    "    .style.format({'webURL': lambda x: f'<a target=\"_blank\" href=\"{x}\"\">Link</a>'})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Simple collaborative filtering"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<style  type=\"text/css\" >\n",
       "</style>  \n",
       "<table id=\"T_a289f8ec_26a0_11e9_a6e0_0242ac120004\" > \n",
       "<thead>    <tr> \n",
       "        <th class=\"blank level0\" ></th> \n",
       "        <th class=\"col_heading level0 col0\" >byline</th> \n",
       "        <th class=\"col_heading level0 col1\" >connComponent</th> \n",
       "        <th class=\"col_heading level0 col2\" >headline</th> \n",
       "        <th class=\"col_heading level0 col3\" >newDesk</th> \n",
       "        <th class=\"col_heading level0 col4\" >pagerank</th> \n",
       "        <th class=\"col_heading level0 col5\" >pubDate</th> \n",
       "        <th class=\"col_heading level0 col6\" >webURL</th> \n",
       "    </tr>    <tr> \n",
       "        <th class=\"index_name level0\" >articleID</th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "    </tr></thead> \n",
       "<tbody>    <tr> \n",
       "        <th id=\"T_a289f8ec_26a0_11e9_a6e0_0242ac120004level0_row0\" class=\"row_heading level0 row0\" >5a8b2f0e10f40f00018c1d8f</th> \n",
       "        <td id=\"T_a289f8ec_26a0_11e9_a6e0_0242ac120004row0_col0\" class=\"data row0 col0\" >By ABBY GOODNOUGH</td> \n",
       "        <td id=\"T_a289f8ec_26a0_11e9_a6e0_0242ac120004row0_col1\" class=\"data row0 col1\" >159386</td> \n",
       "        <td id=\"T_a289f8ec_26a0_11e9_a6e0_0242ac120004row0_col2\" class=\"data row0 col2\" >The Heartburn Behind Free Care for Only Some</td> \n",
       "        <td id=\"T_a289f8ec_26a0_11e9_a6e0_0242ac120004row0_col3\" class=\"data row0 col3\" >Science</td> \n",
       "        <td id=\"T_a289f8ec_26a0_11e9_a6e0_0242ac120004row0_col4\" class=\"data row0 col4\" >2.58539</td> \n",
       "        <td id=\"T_a289f8ec_26a0_11e9_a6e0_0242ac120004row0_col5\" class=\"data row0 col5\" >2018-02-19 20:09:41</td> \n",
       "        <td id=\"T_a289f8ec_26a0_11e9_a6e0_0242ac120004row0_col6\" class=\"data row0 col6\" ><a target=\"_blank\" href=\"https://www.nytimes.com/2018/02/19/health/obamacare-premiums-medicaid.html\"\">Link</a></td> \n",
       "    </tr></tbody> \n",
       "</table> "
      ],
      "text/plain": [
       "<pandas.io.formats.style.Styler at 0x7fd2bfa9afd0>"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cur = graph.run(\"\"\"MATCH (n:ARTICLE) \n",
    "WITH n, rand() as r\n",
    "ORDER BY r\n",
    "RETURN n\n",
    "LIMIT 1\n",
    "\"\"\")\n",
    "article = cur.next().data()['n']\n",
    "pd.DataFrame([article]).set_index('articleID').style.format({'webURL': lambda x: f'<a target=\"_blank\" href=\"{x}\"\">Link</a>'})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<style  type=\"text/css\" >\n",
       "</style>  \n",
       "<table id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004\" > \n",
       "<thead>    <tr> \n",
       "        <th class=\"blank level0\" ></th> \n",
       "        <th class=\"col_heading level0 col0\" >byline</th> \n",
       "        <th class=\"col_heading level0 col1\" >connComponent</th> \n",
       "        <th class=\"col_heading level0 col2\" >headline</th> \n",
       "        <th class=\"col_heading level0 col3\" >newDesk</th> \n",
       "        <th class=\"col_heading level0 col4\" >pagerank</th> \n",
       "        <th class=\"col_heading level0 col5\" >pubDate</th> \n",
       "        <th class=\"col_heading level0 col6\" >webURL</th> \n",
       "        <th class=\"col_heading level0 col7\" >N</th> \n",
       "    </tr>    <tr> \n",
       "        <th class=\"index_name level0\" >articleID</th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "    </tr></thead> \n",
       "<tbody>    <tr> \n",
       "        <th id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004level0_row0\" class=\"row_heading level0 row0\" >58ac68f595d0e02474637c29</th> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row0_col0\" class=\"data row0 col0\" >By MICHAEL D. SHEAR and RON NIXON</td> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row0_col1\" class=\"data row0 col1\" >159386</td> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row0_col2\" class=\"data row0 col2\" >More Immigrants Face Deportation Under New Rules</td> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row0_col3\" class=\"data row0 col3\" >National</td> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row0_col4\" class=\"data row0 col4\" >59.3884</td> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row0_col5\" class=\"data row0 col5\" >2017-02-21 16:21:02</td> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row0_col6\" class=\"data row0 col6\" ><a target=\"_blank\" href=\"https://www.nytimes.com/2017/02/21/us/politics/dhs-immigration-trump.html\"\">Link</a></td> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row0_col7\" class=\"data row0 col7\" >15</td> \n",
       "    </tr>    <tr> \n",
       "        <th id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004level0_row1\" class=\"row_heading level0 row1\" >5ada0944068401528a2a9d2f</th> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row1_col0\" class=\"data row1 col0\" >By AMY CHOZICK</td> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row1_col1\" class=\"data row1 col1\" >159386</td> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row1_col2\" class=\"data row1 col2\" >‘They Were Never Going To Let Me Be President’</td> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row1_col3\" class=\"data row1 col3\" >OpEd</td> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row1_col4\" class=\"data row1 col4\" >35.7204</td> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row1_col5\" class=\"data row1 col5\" >2018-04-20 15:37:32</td> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row1_col6\" class=\"data row1 col6\" ><a target=\"_blank\" href=\"https://www.nytimes.com/2018/04/20/sunday-review/hillary-clinton-chasing-hillary.html\"\">Link</a></td> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row1_col7\" class=\"data row1 col7\" >15</td> \n",
       "    </tr>    <tr> \n",
       "        <th id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004level0_row2\" class=\"row_heading level0 row2\" >58d525e17c459f247805dc9e</th> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row2_col0\" class=\"data row2 col0\" >By ROBERT PEAR, THOMAS KAPLAN and MAGGIE HABERMAN</td> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row2_col1\" class=\"data row2 col1\" >159386</td> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row2_col2\" class=\"data row2 col2\" >G.O.P. Revolt Sinks Bid to Void Health Law</td> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row2_col3\" class=\"data row2 col3\" >National</td> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row2_col4\" class=\"data row2 col4\" >82.2424</td> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row2_col5\" class=\"data row2 col5\" >2017-03-24 13:57:40</td> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row2_col6\" class=\"data row2 col6\" ><a target=\"_blank\" href=\"https://www.nytimes.com/2017/03/24/us/politics/health-care-affordable-care-act.html\"\">Link</a></td> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row2_col7\" class=\"data row2 col7\" >14</td> \n",
       "    </tr>    <tr> \n",
       "        <th id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004level0_row3\" class=\"row_heading level0 row3\" >5add2004068401528a2aa14b</th> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row3_col0\" class=\"data row3 col0\" >By PATRICIA COHEN and ROBERT GEBELOFF</td> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row3_col1\" class=\"data row3 col1\" >159386</td> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row3_col2\" class=\"data row3 col2\" >Public Servants Losing Foothold In Middle Class</td> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row3_col3\" class=\"data row3 col3\" >Business</td> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row3_col4\" class=\"data row3 col4\" >13.2119</td> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row3_col5\" class=\"data row3 col5\" >2018-04-22 23:51:29</td> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row3_col6\" class=\"data row3 col6\" ><a target=\"_blank\" href=\"https://www.nytimes.com/2018/04/22/business/economy/public-employees.html\"\">Link</a></td> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row3_col7\" class=\"data row3 col7\" >13</td> \n",
       "    </tr>    <tr> \n",
       "        <th id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004level0_row4\" class=\"row_heading level0 row4\" >588e0b1e95d0e0392607d69a</th> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row4_col0\" class=\"data row4 col0\" >By PETER BAKER</td> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row4_col1\" class=\"data row4 col1\" >159386</td> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row4_col2\" class=\"data row4 col2\" >Trump Modifies Ban on Migrants as Outcry Grows</td> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row4_col3\" class=\"data row4 col3\" >National</td> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row4_col4\" class=\"data row4 col4\" >53.5918</td> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row4_col5\" class=\"data row4 col5\" >2017-01-29 15:32:40</td> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row4_col6\" class=\"data row4 col6\" ><a target=\"_blank\" href=\"https://www.nytimes.com/2017/01/29/us/politics/white-house-official-in-reversal-says-green-card-holders-wont-be-barred.html\"\">Link</a></td> \n",
       "        <td id=\"T_a3ad020a_26a0_11e9_a6e0_0242ac120004row4_col7\" class=\"data row4 col7\" >12</td> \n",
       "    </tr></tbody> \n",
       "</table> "
      ],
      "text/plain": [
       "<pandas.io.formats.style.Styler at 0x7fd2c26131d0>"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cur = graph.run(\"\"\"MATCH (n:ARTICLE {{articleID: '{0}'}})-[]-(:USER)-[]-(m:ARTICLE)\n",
    "WHERE NOT m.articleID = '{0}'\n",
    "RETURN m\"\"\".format(article['articleID']))\n",
    "df = pd.DataFrame([rec['m'] for rec in yield_record(cur)])\n",
    "N = pd.DataFrame(df.groupby('articleID').size().rename('N'))\n",
    "df1 = df.merge(N, left_on='articleID', right_on='articleID').drop_duplicates().set_index('articleID')\n",
    "df1.sort_values(['N', 'pagerank'], ascending=False).head(5).style.format({'webURL': lambda x: f'<a target=\"_blank\" href=\"{x}\"\">Link</a>'})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
