{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Setup"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "%%capture\n",
    "import sys\n",
    "!{sys.executable} -m pip install py2neo;\n",
    "import py2neo\n",
    "import pandas as pd\n",
    "from scipy import spatial\n",
    "from collections import defaultdict\n",
    "pd.set_option('display.max_columns', 500)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "# -- Connect to Neo4j\n",
    "graph = py2neo.Graph('http://neo4j:7474')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "# -- Func to yield cursor results.\n",
    "def yield_record(cursor):\n",
    "    halt = False\n",
    "    while not halt:\n",
    "        try:\n",
    "            yield cur.next().data()\n",
    "        except:\n",
    "            halt = True"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Data Summary"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Label</th>\n",
       "      <th>N</th>\n",
       "      <th>Mean Degree</th>\n",
       "      <th>Std. Dev. Degree</th>\n",
       "      <th>Median Degree</th>\n",
       "      <th>Min. Degree</th>\n",
       "      <th>Max. Degree</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[ARTICLE]</td>\n",
       "      <td>9298</td>\n",
       "      <td>185.409228</td>\n",
       "      <td>315.736664</td>\n",
       "      <td>57.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>4996.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[USER]</td>\n",
       "      <td>301682</td>\n",
       "      <td>5.714411</td>\n",
       "      <td>21.186375</td>\n",
       "      <td>1.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>1571.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[COMMENTED]</td>\n",
       "      <td>1723935</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "         Label        N  Mean Degree  Std. Dev. Degree  Median Degree  \\\n",
       "0    [ARTICLE]     9298   185.409228        315.736664           57.0   \n",
       "1       [USER]   301682     5.714411         21.186375            1.0   \n",
       "2  [COMMENTED]  1723935          NaN               NaN            NaN   \n",
       "\n",
       "   Min. Degree  Max. Degree  \n",
       "0          1.0       4996.0  \n",
       "1          0.0       1571.0  \n",
       "2          NaN          NaN  "
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# -- Count the number of comments.\n",
    "Ncomments = graph.run(\"\"\"MATCH ()-[r:COMMENTED]->() RETURN count(*)\"\"\").next().data()['count(*)']\n",
    "# -- Get node stats.\n",
    "cur = graph.run(\"\"\"MATCH (n)\n",
    "RETURN\n",
    "DISTINCT labels(n),\n",
    "count(*) AS nNodes,\n",
    "avg(size( (n)-[]-() ) ) as avgDeg,\n",
    "stdev(size( (n)-[]-() ) ) as stdDeg,\n",
    "percentileDisc(size( (n)-[]-() ), 0.5) as medDeg, \n",
    "min(size( (n)-[]-() ) ) as minDeg,\n",
    "max(size( (n)-[]-() ) ) as maxDeg\"\"\")\n",
    "# -- Load into pandas for display.\n",
    "summary = pd.DataFrame(\n",
    "    [list(record.values()) for record in yield_record(cur)] + [[['COMMENTED'], Ncomments]], \n",
    "    columns=['Label', 'N', 'Mean Degree', 'Std. Dev. Degree', 'Median Degree', 'Min. Degree', 'Max. Degree']\n",
    ")\n",
    "summary"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Most users wrote a handful of comments, but there are some super users writing 1K+ commentsin the same timespan. Note that there are User nodes with a degree of 0 (i.e., they are not connected articles).\n",
    "### What articles have the highest degree (i.e., most comments)?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<style  type=\"text/css\" >\n",
       "</style>  \n",
       "<table id=\"T_8171f382_2711_11e9_a4cc_0242ac120004\" > \n",
       "<thead>    <tr> \n",
       "        <th class=\"blank level0\" ></th> \n",
       "        <th class=\"col_heading level0 col0\" >Comments</th> \n",
       "        <th class=\"col_heading level0 col1\" >byline</th> \n",
       "        <th class=\"col_heading level0 col2\" >connComponent</th> \n",
       "        <th class=\"col_heading level0 col3\" >headline</th> \n",
       "        <th class=\"col_heading level0 col4\" >newDesk</th> \n",
       "        <th class=\"col_heading level0 col5\" >pagerank</th> \n",
       "        <th class=\"col_heading level0 col6\" >pubDate</th> \n",
       "        <th class=\"col_heading level0 col7\" >webURL</th> \n",
       "    </tr>    <tr> \n",
       "        <th class=\"index_name level0\" >articleID</th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "    </tr></thead> \n",
       "<tbody>    <tr> \n",
       "        <th id=\"T_8171f382_2711_11e9_a4cc_0242ac120004level0_row0\" class=\"row_heading level0 row0\" >58b0894195d0e0247463875e</th> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row0_col0\" class=\"data row0 col0\" >4996</td> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row0_col1\" class=\"data row0 col1\" >By JULIE HIRSCHFELD DAVIS and MICHAEL M. GRYNBAUM</td> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row0_col2\" class=\"data row0 col2\" >159386</td> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row0_col3\" class=\"data row0 col3\" >Trump Intensifies Criticism of F.B.I. and Journalists</td> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row0_col4\" class=\"data row0 col4\" >National</td> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row0_col5\" class=\"data row0 col5\" >195.696</td> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row0_col6\" class=\"data row0 col6\" >2017-02-24 19:27:53</td> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row0_col7\" class=\"data row0 col7\" ><a target=\"_blank\" href=\"https://www.nytimes.com/2017/02/24/us/politics/white-house-sean-spicer-briefing.html\"\">Link</a></td> \n",
       "    </tr>    <tr> \n",
       "        <th id=\"T_8171f382_2711_11e9_a4cc_0242ac120004level0_row1\" class=\"row_heading level0 row1\" >5912391b7c459f24986de9ab</th> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row1_col0\" class=\"data row1 col0\" >4184</td> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row1_col1\" class=\"data row1 col1\" >By MICHAEL D. SHEAR and MATT APUZZO</td> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row1_col2\" class=\"data row1 col2\" >167890</td> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row1_col3\" class=\"data row1 col3\" >Trump Fires Comey Amid Russia Inquiry</td> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row1_col4\" class=\"data row1 col4\" >National</td> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row1_col5\" class=\"data row1 col5\" >157.107</td> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row1_col6\" class=\"data row1 col6\" >2017-05-09 21:48:03</td> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row1_col7\" class=\"data row1 col7\" ><a target=\"_blank\" href=\"https://www.nytimes.com/2017/05/09/us/politics/james-comey-fired-fbi.html\"\">Link</a></td> \n",
       "    </tr>    <tr> \n",
       "        <th id=\"T_8171f382_2711_11e9_a4cc_0242ac120004level0_row2\" class=\"row_heading level0 row2\" >58ebb1437c459f24986d96ed</th> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row2_col0\" class=\"data row2 col0\" >4014</td> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row2_col1\" class=\"data row2 col1\" >By DANIEL VICTOR and MATT STEVENS</td> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row2_col2\" class=\"data row2 col2\" >167890</td> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row2_col3\" class=\"data row2 col3\" >Man Is Dragged From a Full Jet, Stirring a Furor</td> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row2_col4\" class=\"data row2 col4\" >Business</td> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row2_col5\" class=\"data row2 col5\" >239.803</td> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row2_col6\" class=\"data row2 col6\" >2017-04-10 16:22:22</td> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row2_col7\" class=\"data row2 col7\" ><a target=\"_blank\" href=\"https://www.nytimes.com/2017/04/10/business/united-flight-passenger-dragged.html\"\">Link</a></td> \n",
       "    </tr>    <tr> \n",
       "        <th id=\"T_8171f382_2711_11e9_a4cc_0242ac120004level0_row3\" class=\"row_heading level0 row3\" >591a524d7c459f24986dfc28</th> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row3_col0\" class=\"data row3 col0\" >3791</td> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row3_col1\" class=\"data row3 col1\" >By DAVID BROOKS</td> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row3_col2\" class=\"data row3 col2\" >167890</td> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row3_col3\" class=\"data row3 col3\" >When a Child Is Leading The World</td> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row3_col4\" class=\"data row3 col4\" >OpEd</td> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row3_col5\" class=\"data row3 col5\" >165.153</td> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row3_col6\" class=\"data row3 col6\" >2017-05-16 01:13:44</td> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row3_col7\" class=\"data row3 col7\" ><a target=\"_blank\" href=\"https://www.nytimes.com/2017/05/15/opinion/trump-classified-data.html\"\">Link</a></td> \n",
       "    </tr>    <tr> \n",
       "        <th id=\"T_8171f382_2711_11e9_a4cc_0242ac120004level0_row4\" class=\"row_heading level0 row4\" >5930616f7c459f24986e2e41</th> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row4_col0\" class=\"data row4 col0\" >3709</td> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row4_col1\" class=\"data row4 col1\" >By MICHAEL D. SHEAR</td> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row4_col2\" class=\"data row4 col2\" >167890</td> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row4_col3\" class=\"data row4 col3\" >Trump Abandoning Global Climate Accord</td> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row4_col4\" class=\"data row4 col4\" >Foreign</td> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row4_col5\" class=\"data row4 col5\" >171.479</td> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row4_col6\" class=\"data row4 col6\" >2017-06-01 18:48:08</td> \n",
       "        <td id=\"T_8171f382_2711_11e9_a4cc_0242ac120004row4_col7\" class=\"data row4 col7\" ><a target=\"_blank\" href=\"https://www.nytimes.com/2017/06/01/climate/trump-paris-climate-agreement.html\"\">Link</a></td> \n",
       "    </tr></tbody> \n",
       "</table> "
      ],
      "text/plain": [
       "<pandas.io.formats.style.Styler at 0x7fc7444c73c8>"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# -- Sort articles by the most incoming comment relationships; return top 5.\n",
    "cur = graph.run(\"\"\"MATCH (a:ARTICLE)\n",
    "WITH a, SIZE(()-[:COMMENTED]->(a)) as cmtCnt\n",
    "ORDER BY cmtCnt DESC LIMIT 5\n",
    "MATCH p=()-[:COMMENTED]->(a)\n",
    "RETURN a, count(p)\"\"\")\n",
    "# -- Load into pandas for display.\n",
    "pd.DataFrame([{**res['a'], 'Comments': res['count(p)']} for res in yield_record(cur)]) \\\n",
    "    .sort_values('Comments', ascending=False) \\\n",
    "    .set_index('articleID') \\\n",
    "    .style.format({'webURL': lambda x: f'<a target=\"_blank\" href=\"{x}\"\">Link</a>'})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### What users have the highest degree (i.e., most comments)?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Comments</th>\n",
       "      <th>userDisplayName</th>\n",
       "      <th>userLocation</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>userID</th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>61986282.0</th>\n",
       "      <td>1571</td>\n",
       "      <td>Phyliss Dalmatian</td>\n",
       "      <td>Wichita, Kansas</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17374907.0</th>\n",
       "      <td>1235</td>\n",
       "      <td>Blackmamba</td>\n",
       "      <td>Il</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47123844.0</th>\n",
       "      <td>1232</td>\n",
       "      <td>Richard Luettgen</td>\n",
       "      <td>New Jersey</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47112177.0</th>\n",
       "      <td>1174</td>\n",
       "      <td>manfred m</td>\n",
       "      <td>Bolivia</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37475504.0</th>\n",
       "      <td>1157</td>\n",
       "      <td>John Doe</td>\n",
       "      <td>Johnstown</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "            Comments    userDisplayName     userLocation\n",
       "userID                                                  \n",
       "61986282.0      1571  Phyliss Dalmatian  Wichita, Kansas\n",
       "17374907.0      1235         Blackmamba               Il\n",
       "47123844.0      1232   Richard Luettgen       New Jersey\n",
       "47112177.0      1174          manfred m          Bolivia\n",
       "37475504.0      1157           John Doe        Johnstown"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# -- Sort users by the most outgoing comment relationships; return top 5.\n",
    "cur = graph.run(\"\"\"MATCH (u:USER)\n",
    "WITH u, SIZE((u)-[:COMMENTED]->()) as cmtCnt\n",
    "ORDER BY cmtCnt DESC LIMIT 5\n",
    "MATCH p=(u)-[:COMMENTED]->()\n",
    "RETURN u, count(p)\"\"\")\n",
    "# -- Load into pandas for display.\n",
    "pd.DataFrame([{**res['u'], 'Comments': res['count(p)']} for res in yield_record(cur)]) \\\n",
    "    .drop(columns=['pagerank', 'connComponent']) \\\n",
    "    .sort_values('Comments', ascending=False) \\\n",
    "    .set_index('userID')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Here are some real power users. Most are using pseudonyms. However, Richard Luettgen was a noted NYT commenter: see [A Tribute to a Prolific Times Commenter](https://www.nytimes.com/2018/12/21/reader-center/a-tribute-to-a-prolific-times-commenter.html).\n",
    "## How many subgraphs are there?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Subgraphs: 2369\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nNodes</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>partition</th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>159386</th>\n",
       "      <td>208774</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>167890</th>\n",
       "      <td>99666</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>150435</th>\n",
       "      <td>13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>190309</th>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>217346</th>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "           nNodes\n",
       "partition        \n",
       "159386     208774\n",
       "167890      99666\n",
       "150435         13\n",
       "190309          6\n",
       "217346          6"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cur = graph.run(\"\"\"MATCH (n) \n",
    "RETURN distinct(n.connComponent) as partition, count(*) as nNodes \n",
    "ORDER by nNodes DESC\"\"\")\n",
    "records = list(yield_record(cur))\n",
    "print('Subgraphs: {}'.format(len(records)))\n",
    "df = pd.DataFrame(records).set_index('partition')\n",
    "df.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "There are 2 many subgraphs that comprise most of our data. Otherwise there are a few other mini graphs.\n",
    "## How similar are the two primary subgraphs?\n",
    "### What's the cosine similarity in the relative count of comments to each news desk?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Arts&amp;Leisure</th>\n",
       "      <th>Automobiles</th>\n",
       "      <th>BookReview</th>\n",
       "      <th>Business</th>\n",
       "      <th>Climate</th>\n",
       "      <th>Culture</th>\n",
       "      <th>Dining</th>\n",
       "      <th>EdLife</th>\n",
       "      <th>Editorial</th>\n",
       "      <th>Express</th>\n",
       "      <th>Foreign</th>\n",
       "      <th>Games</th>\n",
       "      <th>Insider</th>\n",
       "      <th>Investigative</th>\n",
       "      <th>Learning</th>\n",
       "      <th>Letters</th>\n",
       "      <th>Magazine</th>\n",
       "      <th>Metro</th>\n",
       "      <th>Metropolitan</th>\n",
       "      <th>NYTNow</th>\n",
       "      <th>National</th>\n",
       "      <th>NewsDesk</th>\n",
       "      <th>Obits</th>\n",
       "      <th>OpEd</th>\n",
       "      <th>Photo</th>\n",
       "      <th>Podcasts</th>\n",
       "      <th>Politics</th>\n",
       "      <th>RealEstate</th>\n",
       "      <th>Science</th>\n",
       "      <th>Smarter Living</th>\n",
       "      <th>Society</th>\n",
       "      <th>SpecialSections</th>\n",
       "      <th>Sports</th>\n",
       "      <th>Styles</th>\n",
       "      <th>Summary</th>\n",
       "      <th>SundayBusiness</th>\n",
       "      <th>TStyle</th>\n",
       "      <th>Travel</th>\n",
       "      <th>Unknown</th>\n",
       "      <th>Upshot</th>\n",
       "      <th>Video</th>\n",
       "      <th>Washington</th>\n",
       "      <th>Weekend</th>\n",
       "      <th>Well</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>159386</th>\n",
       "      <td>0.003127</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.001513</td>\n",
       "      <td>0.045408</td>\n",
       "      <td>0.004445</td>\n",
       "      <td>0.012598</td>\n",
       "      <td>0.008019</td>\n",
       "      <td>0.000552</td>\n",
       "      <td>0.068718</td>\n",
       "      <td>0.002682</td>\n",
       "      <td>0.037567</td>\n",
       "      <td>0.008922</td>\n",
       "      <td>0.002965</td>\n",
       "      <td>0.006598</td>\n",
       "      <td>0.018577</td>\n",
       "      <td>0.000778</td>\n",
       "      <td>0.018825</td>\n",
       "      <td>0.012989</td>\n",
       "      <td>0.003275</td>\n",
       "      <td>0.000033</td>\n",
       "      <td>0.163603</td>\n",
       "      <td>0.001659</td>\n",
       "      <td>0.001789</td>\n",
       "      <td>0.371190</td>\n",
       "      <td>0.000192</td>\n",
       "      <td>0.000073</td>\n",
       "      <td>0.006393</td>\n",
       "      <td>0.003972</td>\n",
       "      <td>0.013778</td>\n",
       "      <td>0.000504</td>\n",
       "      <td>0.000086</td>\n",
       "      <td>0.001013</td>\n",
       "      <td>0.012226</td>\n",
       "      <td>0.005383</td>\n",
       "      <td>0.000023</td>\n",
       "      <td>0.003154</td>\n",
       "      <td>0.000145</td>\n",
       "      <td>0.003088</td>\n",
       "      <td>0.002920</td>\n",
       "      <td>0.015905</td>\n",
       "      <td>0.000244</td>\n",
       "      <td>0.116943</td>\n",
       "      <td>0.002504</td>\n",
       "      <td>0.015621</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>167890</th>\n",
       "      <td>0.003314</td>\n",
       "      <td>0.000017</td>\n",
       "      <td>0.000837</td>\n",
       "      <td>0.051481</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.013302</td>\n",
       "      <td>0.011247</td>\n",
       "      <td>0.002019</td>\n",
       "      <td>0.114654</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.117478</td>\n",
       "      <td>0.006877</td>\n",
       "      <td>0.003416</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.015518</td>\n",
       "      <td>0.000055</td>\n",
       "      <td>0.025351</td>\n",
       "      <td>0.013359</td>\n",
       "      <td>0.000954</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.183552</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.365244</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.002816</td>\n",
       "      <td>0.011994</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.010396</td>\n",
       "      <td>0.001863</td>\n",
       "      <td>0.000020</td>\n",
       "      <td>0.003862</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.003815</td>\n",
       "      <td>0.000657</td>\n",
       "      <td>0.021299</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.003366</td>\n",
       "      <td>0.011237</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        Arts&Leisure  Automobiles  BookReview  Business   Climate   Culture  \\\n",
       "159386      0.003127     0.000000    0.001513  0.045408  0.004445  0.012598   \n",
       "167890      0.003314     0.000017    0.000837  0.051481  0.000000  0.013302   \n",
       "\n",
       "          Dining    EdLife  Editorial   Express   Foreign     Games   Insider  \\\n",
       "159386  0.008019  0.000552   0.068718  0.002682  0.037567  0.008922  0.002965   \n",
       "167890  0.011247  0.002019   0.114654  0.000000  0.117478  0.006877  0.003416   \n",
       "\n",
       "        Investigative  Learning   Letters  Magazine     Metro  Metropolitan  \\\n",
       "159386       0.006598  0.018577  0.000778  0.018825  0.012989      0.003275   \n",
       "167890       0.000000  0.015518  0.000055  0.025351  0.013359      0.000954   \n",
       "\n",
       "          NYTNow  National  NewsDesk     Obits      OpEd     Photo  Podcasts  \\\n",
       "159386  0.000033  0.163603  0.001659  0.001789  0.371190  0.000192  0.000073   \n",
       "167890  0.000000  0.183552  0.000000  0.000000  0.365244  0.000000  0.000000   \n",
       "\n",
       "        Politics  RealEstate   Science  Smarter Living   Society  \\\n",
       "159386  0.006393    0.003972  0.013778        0.000504  0.000086   \n",
       "167890  0.000000    0.002816  0.011994        0.000000  0.000000   \n",
       "\n",
       "        SpecialSections    Sports    Styles   Summary  SundayBusiness  \\\n",
       "159386         0.001013  0.012226  0.005383  0.000023        0.003154   \n",
       "167890         0.000000  0.010396  0.001863  0.000020        0.003862   \n",
       "\n",
       "          TStyle    Travel   Unknown    Upshot     Video  Washington  \\\n",
       "159386  0.000145  0.003088  0.002920  0.015905  0.000244    0.116943   \n",
       "167890  0.000000  0.003815  0.000657  0.021299  0.000000    0.000000   \n",
       "\n",
       "         Weekend      Well  \n",
       "159386  0.002504  0.015621  \n",
       "167890  0.003366  0.011237  "
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "partitions = {}\n",
    "# -- For the two primary subgraphs (i.e., partitions)...\n",
    "for idx in df[df.nNodes > 15].index:\n",
    "    # -- Return the count of comments to each newskdesk.\n",
    "    op = \"\"\"MATCH ()-[r:COMMENTED]-(n:ARTICLE) \n",
    "    WHERE n.connComponent = {} \n",
    "    RETURN n.newDesk, count(r)\"\"\".format(idx)\n",
    "    # -- Add news desk comment count to the partitions dict.\n",
    "    cur = graph.run(op)\n",
    "    records = [rec for rec in yield_record(cur)]\n",
    "    partitions[idx] = {rec['n.newDesk']: rec['count(r)'] for rec in records}\n",
    "df1 = pd.DataFrame(partitions).fillna(0).T\n",
    "df2 = pd.DataFrame(df1.values / df1.sum(axis=1).values[:, None], columns=df1.columns, index=df1.index)\n",
    "df2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0.94123504075479825"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "1 - spatial.distance.cosine(df1.iloc[0, :].fillna(0), df1.iloc[1, :].fillna(0))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The two graphs have a very high cosine similarity based on the news desks that their users are commenting on.\n",
    "## What are the most influential articles (i.e., what articles have the highest PageRank)?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<style  type=\"text/css\" >\n",
       "</style>  \n",
       "<table id=\"T_836a1b60_2711_11e9_a4cc_0242ac120004\" > \n",
       "<thead>    <tr> \n",
       "        <th class=\"blank level0\" ></th> \n",
       "        <th class=\"col_heading level0 col0\" >byline</th> \n",
       "        <th class=\"col_heading level0 col1\" >headline</th> \n",
       "        <th class=\"col_heading level0 col2\" >newDesk</th> \n",
       "        <th class=\"col_heading level0 col3\" >pagerank</th> \n",
       "        <th class=\"col_heading level0 col4\" >pubDate</th> \n",
       "        <th class=\"col_heading level0 col5\" >webURL</th> \n",
       "    </tr>    <tr> \n",
       "        <th class=\"index_name level0\" >articleID</th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "    </tr></thead> \n",
       "<tbody>    <tr> \n",
       "        <th id=\"T_836a1b60_2711_11e9_a4cc_0242ac120004level0_row0\" class=\"row_heading level0 row0\" >58e4d28e7c459f24986d87c9</th> \n",
       "        <td id=\"T_836a1b60_2711_11e9_a4cc_0242ac120004row0_col0\" class=\"data row0 col0\" >By KATHERINE SCHULTEN</td> \n",
       "        <td id=\"T_836a1b60_2711_11e9_a4cc_0242ac120004row0_col1\" class=\"data row0 col1\" >Our Eighth Annual Found Poem Student Contest</td> \n",
       "        <td id=\"T_836a1b60_2711_11e9_a4cc_0242ac120004row0_col2\" class=\"data row0 col2\" >Learning</td> \n",
       "        <td id=\"T_836a1b60_2711_11e9_a4cc_0242ac120004row0_col3\" class=\"data row0 col3\" >272.599</td> \n",
       "        <td id=\"T_836a1b60_2711_11e9_a4cc_0242ac120004row0_col4\" class=\"data row0 col4\" >2017-04-05 11:18:34</td> \n",
       "        <td id=\"T_836a1b60_2711_11e9_a4cc_0242ac120004row0_col5\" class=\"data row0 col5\" ><a target=\"_blank\" href=\"https://www.nytimes.com/2017/04/05/learning/our-eighth-annual-found-poem-student-contest.html\"\">Link</a></td> \n",
       "    </tr>    <tr> \n",
       "        <th id=\"T_836a1b60_2711_11e9_a4cc_0242ac120004level0_row1\" class=\"row_heading level0 row1\" >58ebb1437c459f24986d96ed</th> \n",
       "        <td id=\"T_836a1b60_2711_11e9_a4cc_0242ac120004row1_col0\" class=\"data row1 col0\" >By DANIEL VICTOR and MATT STEVENS</td> \n",
       "        <td id=\"T_836a1b60_2711_11e9_a4cc_0242ac120004row1_col1\" class=\"data row1 col1\" >Man Is Dragged From a Full Jet, Stirring a Furor</td> \n",
       "        <td id=\"T_836a1b60_2711_11e9_a4cc_0242ac120004row1_col2\" class=\"data row1 col2\" >Business</td> \n",
       "        <td id=\"T_836a1b60_2711_11e9_a4cc_0242ac120004row1_col3\" class=\"data row1 col3\" >239.803</td> \n",
       "        <td id=\"T_836a1b60_2711_11e9_a4cc_0242ac120004row1_col4\" class=\"data row1 col4\" >2017-04-10 16:22:22</td> \n",
       "        <td id=\"T_836a1b60_2711_11e9_a4cc_0242ac120004row1_col5\" class=\"data row1 col5\" ><a target=\"_blank\" href=\"https://www.nytimes.com/2017/04/10/business/united-flight-passenger-dragged.html\"\">Link</a></td> \n",
       "    </tr>    <tr> \n",
       "        <th id=\"T_836a1b60_2711_11e9_a4cc_0242ac120004level0_row2\" class=\"row_heading level0 row2\" >58b0894195d0e0247463875e</th> \n",
       "        <td id=\"T_836a1b60_2711_11e9_a4cc_0242ac120004row2_col0\" class=\"data row2 col0\" >By JULIE HIRSCHFELD DAVIS and MICHAEL M. GRYNBAUM</td> \n",
       "        <td id=\"T_836a1b60_2711_11e9_a4cc_0242ac120004row2_col1\" class=\"data row2 col1\" >Trump Intensifies Criticism of F.B.I. and Journalists</td> \n",
       "        <td id=\"T_836a1b60_2711_11e9_a4cc_0242ac120004row2_col2\" class=\"data row2 col2\" >National</td> \n",
       "        <td id=\"T_836a1b60_2711_11e9_a4cc_0242ac120004row2_col3\" class=\"data row2 col3\" >195.696</td> \n",
       "        <td id=\"T_836a1b60_2711_11e9_a4cc_0242ac120004row2_col4\" class=\"data row2 col4\" >2017-02-24 19:27:53</td> \n",
       "        <td id=\"T_836a1b60_2711_11e9_a4cc_0242ac120004row2_col5\" class=\"data row2 col5\" ><a target=\"_blank\" href=\"https://www.nytimes.com/2017/02/24/us/politics/white-house-sean-spicer-briefing.html\"\">Link</a></td> \n",
       "    </tr>    <tr> \n",
       "        <th id=\"T_836a1b60_2711_11e9_a4cc_0242ac120004level0_row3\" class=\"row_heading level0 row3\" >5930616f7c459f24986e2e41</th> \n",
       "        <td id=\"T_836a1b60_2711_11e9_a4cc_0242ac120004row3_col0\" class=\"data row3 col0\" >By MICHAEL D. SHEAR</td> \n",
       "        <td id=\"T_836a1b60_2711_11e9_a4cc_0242ac120004row3_col1\" class=\"data row3 col1\" >Trump Abandoning Global Climate Accord</td> \n",
       "        <td id=\"T_836a1b60_2711_11e9_a4cc_0242ac120004row3_col2\" class=\"data row3 col2\" >Foreign</td> \n",
       "        <td id=\"T_836a1b60_2711_11e9_a4cc_0242ac120004row3_col3\" class=\"data row3 col3\" >171.479</td> \n",
       "        <td id=\"T_836a1b60_2711_11e9_a4cc_0242ac120004row3_col4\" class=\"data row3 col4\" >2017-06-01 18:48:08</td> \n",
       "        <td id=\"T_836a1b60_2711_11e9_a4cc_0242ac120004row3_col5\" class=\"data row3 col5\" ><a target=\"_blank\" href=\"https://www.nytimes.com/2017/06/01/climate/trump-paris-climate-agreement.html\"\">Link</a></td> \n",
       "    </tr>    <tr> \n",
       "        <th id=\"T_836a1b60_2711_11e9_a4cc_0242ac120004level0_row4\" class=\"row_heading level0 row4\" >591a524d7c459f24986dfc28</th> \n",
       "        <td id=\"T_836a1b60_2711_11e9_a4cc_0242ac120004row4_col0\" class=\"data row4 col0\" >By DAVID BROOKS</td> \n",
       "        <td id=\"T_836a1b60_2711_11e9_a4cc_0242ac120004row4_col1\" class=\"data row4 col1\" >When a Child Is Leading The World</td> \n",
       "        <td id=\"T_836a1b60_2711_11e9_a4cc_0242ac120004row4_col2\" class=\"data row4 col2\" >OpEd</td> \n",
       "        <td id=\"T_836a1b60_2711_11e9_a4cc_0242ac120004row4_col3\" class=\"data row4 col3\" >165.153</td> \n",
       "        <td id=\"T_836a1b60_2711_11e9_a4cc_0242ac120004row4_col4\" class=\"data row4 col4\" >2017-05-16 01:13:44</td> \n",
       "        <td id=\"T_836a1b60_2711_11e9_a4cc_0242ac120004row4_col5\" class=\"data row4 col5\" ><a target=\"_blank\" href=\"https://www.nytimes.com/2017/05/15/opinion/trump-classified-data.html\"\">Link</a></td> \n",
       "    </tr></tbody> \n",
       "</table> "
      ],
      "text/plain": [
       "<pandas.io.formats.style.Styler at 0x7fc7411490b8>"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# -- Collect top 5 articles by PageRank.\n",
    "cur = graph.run(\"\"\"MATCH (n:ARTICLE)\n",
    "RETURN n\n",
    "ORDER by n.pagerank\n",
    "DESC LIMIT 5\"\"\")\n",
    "# -- Load into pandas for display.\n",
    "pd.DataFrame([rec['n'] for rec in yield_record(cur)]) \\\n",
    "    .sort_values('pagerank', ascending=False) \\\n",
    "    .set_index('articleID') \\\n",
    "    .drop('connComponent', axis=1) \\\n",
    "    .style.format({'webURL': lambda x: f'<a target=\"_blank\" href=\"{x}\"\">Link</a>'})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Interesting that the top two articles by page rank are apolitical. Also, it's wholesome to see that a poem contest is the most central article (art bringing people together).\n",
    "## Simple collaborative filtering (i.e., commenters of this article also commented on)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<style  type=\"text/css\" >\n",
       "</style>  \n",
       "<table id=\"T_8c9306a2_2711_11e9_a4cc_0242ac120004\" > \n",
       "<thead>    <tr> \n",
       "        <th class=\"blank level0\" ></th> \n",
       "        <th class=\"col_heading level0 col0\" >byline</th> \n",
       "        <th class=\"col_heading level0 col1\" >connComponent</th> \n",
       "        <th class=\"col_heading level0 col2\" >headline</th> \n",
       "        <th class=\"col_heading level0 col3\" >newDesk</th> \n",
       "        <th class=\"col_heading level0 col4\" >pagerank</th> \n",
       "        <th class=\"col_heading level0 col5\" >pubDate</th> \n",
       "        <th class=\"col_heading level0 col6\" >webURL</th> \n",
       "    </tr>    <tr> \n",
       "        <th class=\"index_name level0\" >articleID</th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "    </tr></thead> \n",
       "<tbody>    <tr> \n",
       "        <th id=\"T_8c9306a2_2711_11e9_a4cc_0242ac120004level0_row0\" class=\"row_heading level0 row0\" >5ab8b69447de81a901217296</th> \n",
       "        <td id=\"T_8c9306a2_2711_11e9_a4cc_0242ac120004row0_col0\" class=\"data row0 col0\" >By SHANNON DOYNE</td> \n",
       "        <td id=\"T_8c9306a2_2711_11e9_a4cc_0242ac120004row0_col1\" class=\"data row0 col1\" >159386</td> \n",
       "        <td id=\"T_8c9306a2_2711_11e9_a4cc_0242ac120004row0_col2\" class=\"data row0 col2\" >Do Other People Care Too Much About Your Post-High School Plans?</td> \n",
       "        <td id=\"T_8c9306a2_2711_11e9_a4cc_0242ac120004row0_col3\" class=\"data row0 col3\" >Learning</td> \n",
       "        <td id=\"T_8c9306a2_2711_11e9_a4cc_0242ac120004row0_col4\" class=\"data row0 col4\" >3.7115</td> \n",
       "        <td id=\"T_8c9306a2_2711_11e9_a4cc_0242ac120004row0_col5\" class=\"data row0 col5\" >2018-03-26 09:00:00</td> \n",
       "        <td id=\"T_8c9306a2_2711_11e9_a4cc_0242ac120004row0_col6\" class=\"data row0 col6\" ><a target=\"_blank\" href=\"https://www.nytimes.com/2018/03/26/learning/do-other-people-care-too-much-about-your-post-high-school-plans.html\"\">Link</a></td> \n",
       "    </tr></tbody> \n",
       "</table> "
      ],
      "text/plain": [
       "<pandas.io.formats.style.Styler at 0x7fc77061d8d0>"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# -- Get a random article to give recommendations for.\n",
    "cur = graph.run(\"MATCH (n:ARTICLE) WITH n, rand() as r ORDER BY r RETURN n LIMIT 1\")\n",
    "article = cur.next().data()['n']\n",
    "# -- Load into pandas for display.\n",
    "pd.DataFrame([article]) \\\n",
    "    .set_index('articleID') \\\n",
    "    .style.format({'webURL': lambda x: f'<a target=\"_blank\" href=\"{x}\"\">Link</a>'})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<style  type=\"text/css\" >\n",
       "</style>  \n",
       "<table id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004\" > \n",
       "<thead>    <tr> \n",
       "        <th class=\"blank level0\" ></th> \n",
       "        <th class=\"col_heading level0 col0\" >byline</th> \n",
       "        <th class=\"col_heading level0 col1\" >connComponent</th> \n",
       "        <th class=\"col_heading level0 col2\" >headline</th> \n",
       "        <th class=\"col_heading level0 col3\" >newDesk</th> \n",
       "        <th class=\"col_heading level0 col4\" >pagerank</th> \n",
       "        <th class=\"col_heading level0 col5\" >pubDate</th> \n",
       "        <th class=\"col_heading level0 col6\" >webURL</th> \n",
       "        <th class=\"col_heading level0 col7\" >N</th> \n",
       "    </tr>    <tr> \n",
       "        <th class=\"index_name level0\" >articleID</th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "    </tr></thead> \n",
       "<tbody>    <tr> \n",
       "        <th id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004level0_row0\" class=\"row_heading level0 row0\" >5a9fb845410cf7000162f27d</th> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row0_col0\" class=\"data row0 col0\" >By CAROLINE CROSSON GILPIN</td> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row0_col1\" class=\"data row0 col1\" >159386</td> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row0_col2\" class=\"data row0 col2\" >Should the Voting Age Be Lowered to 16?</td> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row0_col3\" class=\"data row0 col3\" >Learning</td> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row0_col4\" class=\"data row0 col4\" >8.01729</td> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row0_col5\" class=\"data row0 col5\" >2018-03-07 10:00:31</td> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row0_col6\" class=\"data row0 col6\" ><a target=\"_blank\" href=\"https://www.nytimes.com/2018/03/07/learning/should-the-voting-age-be-lowered-to-16.html\"\">Link</a></td> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row0_col7\" class=\"data row0 col7\" >17</td> \n",
       "    </tr>    <tr> \n",
       "        <th id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004level0_row1\" class=\"row_heading level0 row1\" >5a8fe63410f40f00018c2971</th> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row1_col0\" class=\"data row1 col0\" >By NATALIE PROULX</td> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row1_col1\" class=\"data row1 col1\" >159386</td> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row1_col2\" class=\"data row1 col2\" >Should Teachers Be Armed With Guns?</td> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row1_col3\" class=\"data row1 col3\" >Learning</td> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row1_col4\" class=\"data row1 col4\" >36.4021</td> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row1_col5\" class=\"data row1 col5\" >2018-02-23 10:00:01</td> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row1_col6\" class=\"data row1 col6\" ><a target=\"_blank\" href=\"https://www.nytimes.com/2018/02/23/learning/should-teachers-be-armed-with-guns.html\"\">Link</a></td> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row1_col7\" class=\"data row1 col7\" >13</td> \n",
       "    </tr>    <tr> \n",
       "        <th id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004level0_row2\" class=\"row_heading level0 row2\" >5a9920cb410cf7000162ed5b</th> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row2_col0\" class=\"data row2 col0\" >By NATALIE PROULX</td> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row2_col1\" class=\"data row2 col1\" >159386</td> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row2_col2\" class=\"data row2 col2\" >Is It Harder to Grow Up in the 21st Century Than It Was in the Past?</td> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row2_col3\" class=\"data row2 col3\" >Learning</td> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row2_col4\" class=\"data row2 col4\" >9.41816</td> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row2_col5\" class=\"data row2 col5\" >2018-03-02 10:00:01</td> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row2_col6\" class=\"data row2 col6\" ><a target=\"_blank\" href=\"https://www.nytimes.com/2018/03/02/learning/is-it-harder-to-grow-up-in-the-21st-century-than-it-was-in-the-past.html\"\">Link</a></td> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row2_col7\" class=\"data row2 col7\" >11</td> \n",
       "    </tr>    <tr> \n",
       "        <th id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004level0_row3\" class=\"row_heading level0 row3\" >5ab3709647de81a901215188</th> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row3_col0\" class=\"data row3 col0\" >By NATALIE PROULX</td> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row3_col1\" class=\"data row3 col1\" >159386</td> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row3_col2\" class=\"data row3 col2\" >What Makes Someone a Great Leader?</td> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row3_col3\" class=\"data row3 col3\" >Learning</td> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row3_col4\" class=\"data row3 col4\" >2.72779</td> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row3_col5\" class=\"data row3 col5\" >2018-03-22 09:00:01</td> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row3_col6\" class=\"data row3 col6\" ><a target=\"_blank\" href=\"https://www.nytimes.com/2018/03/22/learning/what-makes-someone-a-great-leader.html\"\">Link</a></td> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row3_col7\" class=\"data row3 col7\" >11</td> \n",
       "    </tr>    <tr> \n",
       "        <th id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004level0_row4\" class=\"row_heading level0 row4\" >5ab0cd9647de81a9012130e2</th> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row4_col0\" class=\"data row4 col0\" >By NATALIE PROULX</td> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row4_col1\" class=\"data row4 col1\" >159386</td> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row4_col2\" class=\"data row4 col2\" >Are We Being Bad Citizens If We Don’t Keep Up With the News?</td> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row4_col3\" class=\"data row4 col3\" >Learning</td> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row4_col4\" class=\"data row4 col4\" >5.80189</td> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row4_col5\" class=\"data row4 col5\" >2018-03-20 09:00:01</td> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row4_col6\" class=\"data row4 col6\" ><a target=\"_blank\" href=\"https://www.nytimes.com/2018/03/20/learning/are-we-being-bad-citizens-if-we-dont-keep-up-with-the-news.html\"\">Link</a></td> \n",
       "        <td id=\"T_8dbfd4d8_2711_11e9_a4cc_0242ac120004row4_col7\" class=\"data row4 col7\" >8</td> \n",
       "    </tr></tbody> \n",
       "</table> "
      ],
      "text/plain": [
       "<pandas.io.formats.style.Styler at 0x7fc7407bfef0>"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# -- Using the random article above, \n",
    "# -- collect other articles that are 2 hops away\n",
    "# -- (ie., (given_article)<-[:COMMENTED]-(:USER)-[:COMMENTED]->(articles_of_interest))\n",
    "cur = graph.run(\"\"\"MATCH (n:ARTICLE {{articleID: '{}'}})-[]-(:USER)-[]-(m:ARTICLE)\n",
    "WHERE NOT m.headline = '{}'\n",
    "RETURN m\"\"\".format(article['articleID'], article['headlineE']))\n",
    "# -- Create a dataframe, drop articles with 'Unknown' headliness\n",
    "df = pd.DataFrame([rec['m'] for rec in yield_record(cur)])\n",
    "df = df[df.headline != 'Unknown']\n",
    "# -- Collect a count of potential recommendations.\n",
    "N = pd.DataFrame(df.groupby('articleID').size().rename('N'))\n",
    "# -- Merge count of recommendations into 2 hop articles for display.\n",
    "df1 = df.merge(N, left_on='articleID', right_on='articleID').drop_duplicates().set_index('articleID')\n",
    "# -- Show top 5 articles by 2 hop connections and break ties with pagerank.\n",
    "df1.sort_values(['N', 'pagerank'], ascending=False) \\\n",
    "    .head(5) \\\n",
    "    .style.format({'webURL': lambda x: f'<a target=\"_blank\" href=\"{x}\"\">Link</a>'})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
