{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "%%capture\n",
    "import sys\n",
    "!{sys.executable} -m pip install py2neo;\n",
    "import py2neo\n",
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph = py2neo.Graph('http://neo4j:7474')\n",
    "\n",
    "def yield_results(cursor):\n",
    "    halt = False\n",
    "    while not halt:\n",
    "        try:\n",
    "            yield cur.next().data()\n",
    "        except:\n",
    "            halt = True"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# New York Times Comments\n",
    "The data contains information about the comments made on the articles published in New York Times in Jan-May 2017 and Jan-April 2018.\n",
    "\n",
    "See: https://www.kaggle.com/aashita/nyt-comments/home"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Data Summary\n",
    "### Record Counts"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Counts</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>Articles</th>\n",
       "      <td>9298</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Users</th>\n",
       "      <td>301682</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Comments</th>\n",
       "      <td>1723935</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "           Counts\n",
       "Articles     9298\n",
       "Users      301682\n",
       "Comments  1723935"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pd.DataFrame(\n",
    "    [\n",
    "        graph.run(\"MATCH (n:ARTICLE) RETURN count(*)\").next().data()['count(*)'],\n",
    "        graph.run(\"MATCH (n:USER) RETURN count(*)\").next().data()['count(*)'],\n",
    "        graph.run(\"MATCH ()-[r:COMMENTED]->() RETURN count(*)\").next().data()['count(*)']\n",
    "    ],\n",
    "    index=['Articles', 'Users', 'Comments'],\n",
    "    columns=['Counts']\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### What articles have the highest degree (i.e., most comments)?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<style  type=\"text/css\" >\n",
       "</style>  \n",
       "<table id=\"T_a81925e4_2501_11e9_99b3_0242ac120003\" > \n",
       "<thead>    <tr> \n",
       "        <th class=\"blank level0\" ></th> \n",
       "        <th class=\"col_heading level0 col0\" >Comments</th> \n",
       "        <th class=\"col_heading level0 col1\" >byline</th> \n",
       "        <th class=\"col_heading level0 col2\" >headline</th> \n",
       "        <th class=\"col_heading level0 col3\" >newDesk</th> \n",
       "        <th class=\"col_heading level0 col4\" >partition</th> \n",
       "        <th class=\"col_heading level0 col5\" >pubDate</th> \n",
       "        <th class=\"col_heading level0 col6\" >webURL</th> \n",
       "    </tr>    <tr> \n",
       "        <th class=\"index_name level0\" >articleID</th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "        <th class=\"blank\" ></th> \n",
       "    </tr></thead> \n",
       "<tbody>    <tr> \n",
       "        <th id=\"T_a81925e4_2501_11e9_99b3_0242ac120003level0_row0\" class=\"row_heading level0 row0\" >58b0894195d0e0247463875e</th> \n",
       "        <td id=\"T_a81925e4_2501_11e9_99b3_0242ac120003row0_col0\" class=\"data row0 col0\" >4996</td> \n",
       "        <td id=\"T_a81925e4_2501_11e9_99b3_0242ac120003row0_col1\" class=\"data row0 col1\" >By JULIE HIRSCHFELD DAVIS and MICHAEL M. GRYNBAUM</td> \n",
       "        <td id=\"T_a81925e4_2501_11e9_99b3_0242ac120003row0_col2\" class=\"data row0 col2\" >Trump Intensifies Criticism of F.B.I. and Journalists</td> \n",
       "        <td id=\"T_a81925e4_2501_11e9_99b3_0242ac120003row0_col3\" class=\"data row0 col3\" >National</td> \n",
       "        <td id=\"T_a81925e4_2501_11e9_99b3_0242ac120003row0_col4\" class=\"data row0 col4\" >155571</td> \n",
       "        <td id=\"T_a81925e4_2501_11e9_99b3_0242ac120003row0_col5\" class=\"data row0 col5\" >2017-02-24 19:27:53</td> \n",
       "        <td id=\"T_a81925e4_2501_11e9_99b3_0242ac120003row0_col6\" class=\"data row0 col6\" ><a target=\"_blank\" href=\"https://www.nytimes.com/2017/02/24/us/politics/white-house-sean-spicer-briefing.html\"\">Link</a></td> \n",
       "    </tr>    <tr> \n",
       "        <th id=\"T_a81925e4_2501_11e9_99b3_0242ac120003level0_row1\" class=\"row_heading level0 row1\" >5912391b7c459f24986de9ab</th> \n",
       "        <td id=\"T_a81925e4_2501_11e9_99b3_0242ac120003row1_col0\" class=\"data row1 col0\" >4184</td> \n",
       "        <td id=\"T_a81925e4_2501_11e9_99b3_0242ac120003row1_col1\" class=\"data row1 col1\" >By MICHAEL D. SHEAR and MATT APUZZO</td> \n",
       "        <td id=\"T_a81925e4_2501_11e9_99b3_0242ac120003row1_col2\" class=\"data row1 col2\" >Trump Fires Comey Amid Russia Inquiry</td> \n",
       "        <td id=\"T_a81925e4_2501_11e9_99b3_0242ac120003row1_col3\" class=\"data row1 col3\" >National</td> \n",
       "        <td id=\"T_a81925e4_2501_11e9_99b3_0242ac120003row1_col4\" class=\"data row1 col4\" >177172</td> \n",
       "        <td id=\"T_a81925e4_2501_11e9_99b3_0242ac120003row1_col5\" class=\"data row1 col5\" >2017-05-09 21:48:03</td> \n",
       "        <td id=\"T_a81925e4_2501_11e9_99b3_0242ac120003row1_col6\" class=\"data row1 col6\" ><a target=\"_blank\" href=\"https://www.nytimes.com/2017/05/09/us/politics/james-comey-fired-fbi.html\"\">Link</a></td> \n",
       "    </tr>    <tr> \n",
       "        <th id=\"T_a81925e4_2501_11e9_99b3_0242ac120003level0_row2\" class=\"row_heading level0 row2\" >58ebb1437c459f24986d96ed</th> \n",
       "        <td id=\"T_a81925e4_2501_11e9_99b3_0242ac120003row2_col0\" class=\"data row2 col0\" >4014</td> \n",
       "        <td id=\"T_a81925e4_2501_11e9_99b3_0242ac120003row2_col1\" class=\"data row2 col1\" >By DANIEL VICTOR and MATT STEVENS</td> \n",
       "        <td id=\"T_a81925e4_2501_11e9_99b3_0242ac120003row2_col2\" class=\"data row2 col2\" >Man Is Dragged From a Full Jet, Stirring a Furor</td> \n",
       "        <td id=\"T_a81925e4_2501_11e9_99b3_0242ac120003row2_col3\" class=\"data row2 col3\" >Business</td> \n",
       "        <td id=\"T_a81925e4_2501_11e9_99b3_0242ac120003row2_col4\" class=\"data row2 col4\" >177172</td> \n",
       "        <td id=\"T_a81925e4_2501_11e9_99b3_0242ac120003row2_col5\" class=\"data row2 col5\" >2017-04-10 16:22:22</td> \n",
       "        <td id=\"T_a81925e4_2501_11e9_99b3_0242ac120003row2_col6\" class=\"data row2 col6\" ><a target=\"_blank\" href=\"https://www.nytimes.com/2017/04/10/business/united-flight-passenger-dragged.html\"\">Link</a></td> \n",
       "    </tr>    <tr> \n",
       "        <th id=\"T_a81925e4_2501_11e9_99b3_0242ac120003level0_row3\" class=\"row_heading level0 row3\" >591a524d7c459f24986dfc28</th> \n",
       "        <td id=\"T_a81925e4_2501_11e9_99b3_0242ac120003row3_col0\" class=\"data row3 col0\" >3791</td> \n",
       "        <td id=\"T_a81925e4_2501_11e9_99b3_0242ac120003row3_col1\" class=\"data row3 col1\" >By DAVID BROOKS</td> \n",
       "        <td id=\"T_a81925e4_2501_11e9_99b3_0242ac120003row3_col2\" class=\"data row3 col2\" >When a Child Is Leading The World</td> \n",
       "        <td id=\"T_a81925e4_2501_11e9_99b3_0242ac120003row3_col3\" class=\"data row3 col3\" >OpEd</td> \n",
       "        <td id=\"T_a81925e4_2501_11e9_99b3_0242ac120003row3_col4\" class=\"data row3 col4\" >177172</td> \n",
       "        <td id=\"T_a81925e4_2501_11e9_99b3_0242ac120003row3_col5\" class=\"data row3 col5\" >2017-05-16 01:13:44</td> \n",
       "        <td id=\"T_a81925e4_2501_11e9_99b3_0242ac120003row3_col6\" class=\"data row3 col6\" ><a target=\"_blank\" href=\"https://www.nytimes.com/2017/05/15/opinion/trump-classified-data.html\"\">Link</a></td> \n",
       "    </tr>    <tr> \n",
       "        <th id=\"T_a81925e4_2501_11e9_99b3_0242ac120003level0_row4\" class=\"row_heading level0 row4\" >5930616f7c459f24986e2e41</th> \n",
       "        <td id=\"T_a81925e4_2501_11e9_99b3_0242ac120003row4_col0\" class=\"data row4 col0\" >3709</td> \n",
       "        <td id=\"T_a81925e4_2501_11e9_99b3_0242ac120003row4_col1\" class=\"data row4 col1\" >By MICHAEL D. SHEAR</td> \n",
       "        <td id=\"T_a81925e4_2501_11e9_99b3_0242ac120003row4_col2\" class=\"data row4 col2\" >Trump Abandoning Global Climate Accord</td> \n",
       "        <td id=\"T_a81925e4_2501_11e9_99b3_0242ac120003row4_col3\" class=\"data row4 col3\" >Foreign</td> \n",
       "        <td id=\"T_a81925e4_2501_11e9_99b3_0242ac120003row4_col4\" class=\"data row4 col4\" >177172</td> \n",
       "        <td id=\"T_a81925e4_2501_11e9_99b3_0242ac120003row4_col5\" class=\"data row4 col5\" >2017-06-01 18:48:08</td> \n",
       "        <td id=\"T_a81925e4_2501_11e9_99b3_0242ac120003row4_col6\" class=\"data row4 col6\" ><a target=\"_blank\" href=\"https://www.nytimes.com/2017/06/01/climate/trump-paris-climate-agreement.html\"\">Link</a></td> \n",
       "    </tr></tbody> \n",
       "</table> "
      ],
      "text/plain": [
       "<pandas.io.formats.style.Styler at 0x7fa4b8f61ac8>"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cur = graph.run(\"\"\"MATCH (a:ARTICLE)\n",
    "WITH a, SIZE(()-[:COMMENTED]->(a)) as cmtCnt\n",
    "ORDER BY cmtCnt DESC LIMIT 5\n",
    "MATCH p=()-[:COMMENTED]->(a)\n",
    "RETURN a, count(p)\"\"\")\n",
    "\n",
    "pd.DataFrame([{**res['a'], 'Comments': res['count(p)']} for res in yield_results(cur)]) \\\n",
    "    .sort_values('Comments', ascending=False) \\\n",
    "    .set_index('articleID') \\\n",
    "    .style.format({'webURL': lambda x: f'<a target=\"_blank\" href=\"{x}\"\">Link</a>'})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### What users have the highest degree (i.e., most comments)?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Comments</th>\n",
       "      <th>partition</th>\n",
       "      <th>userDisplayName</th>\n",
       "      <th>userLocation</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>userID</th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>61986282.0</th>\n",
       "      <td>1571</td>\n",
       "      <td>155571</td>\n",
       "      <td>Phyliss Dalmatian</td>\n",
       "      <td>Wichita, Kansas</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17374907.0</th>\n",
       "      <td>1235</td>\n",
       "      <td>155571</td>\n",
       "      <td>Blackmamba</td>\n",
       "      <td>Il</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47123844.0</th>\n",
       "      <td>1232</td>\n",
       "      <td>155571</td>\n",
       "      <td>Richard Luettgen</td>\n",
       "      <td>New Jersey</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47112177.0</th>\n",
       "      <td>1174</td>\n",
       "      <td>155571</td>\n",
       "      <td>manfred m</td>\n",
       "      <td>Bolivia</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37475504.0</th>\n",
       "      <td>1157</td>\n",
       "      <td>155571</td>\n",
       "      <td>John Doe</td>\n",
       "      <td>Johnstown</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "            Comments  partition    userDisplayName     userLocation\n",
       "userID                                                             \n",
       "61986282.0      1571     155571  Phyliss Dalmatian  Wichita, Kansas\n",
       "17374907.0      1235     155571         Blackmamba               Il\n",
       "47123844.0      1232     155571   Richard Luettgen       New Jersey\n",
       "47112177.0      1174     155571          manfred m          Bolivia\n",
       "37475504.0      1157     155571           John Doe        Johnstown"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cur = graph.run(\"\"\"MATCH (u:USER)\n",
    "WITH u, SIZE((u)-[:COMMENTED]->()) as cmtCnt\n",
    "ORDER BY cmtCnt DESC LIMIT 5\n",
    "MATCH p=(u)-[:COMMENTED]->()\n",
    "RETURN u, count(p)\"\"\")\n",
    "\n",
    "pd.DataFrame([{**res['u'], 'Comments': res['count(p)']} for res in yield_results(cur)]) \\\n",
    "    .sort_values('Comments', ascending=False) \\\n",
    "    .set_index('userID')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'name': 'algo.allShortestPaths.stream',\n",
       "  'signature': 'algo.allShortestPaths.stream(propertyName :: STRING?, config = {} :: MAP?) :: (sourceNodeId :: INTEGER?, targetNodeId :: INTEGER?, distance :: FLOAT?)',\n",
       "  'description': \"CALL algo.allShortestPaths.stream(weightProperty:String{nodeQuery:'labelName', relationshipQuery:'relationshipName', defaultValue:1.0, concurrency:4}) YIELD sourceNodeId, targetNodeId, distance - yields a stream of {sourceNodeId, targetNodeId, distance}\"},\n",
       " {'name': 'algo.articleRank',\n",
       "  'signature': 'algo.articleRank(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (nodes :: INTEGER?, iterations :: INTEGER?, loadMillis :: INTEGER?, computeMillis :: INTEGER?, writeMillis :: INTEGER?, dampingFactor :: FLOAT?, write :: BOOLEAN?, writeProperty :: STRING?)',\n",
       "  'description': \"CALL algo.articleRank(label:String, relationship:String, {iterations:5, dampingFactor:0.85, weightProperty: null, write: true, writeProperty:'articlerank', concurrency:4}) YIELD nodes, iterations, loadMillis, computeMillis, writeMillis, dampingFactor, write, writeProperty - calculates page rank and potentially writes back\"},\n",
       " {'name': 'algo.articleRank.stream',\n",
       "  'signature': 'algo.articleRank.stream(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (nodeId :: INTEGER?, score :: FLOAT?)',\n",
       "  'description': 'CALL algo.articleRank.stream(label:String, relationship:String, {iterations:20, dampingFactor:0.85, weightProperty: null, concurrency:4}) YIELD node, score - calculates page rank and streams results'},\n",
       " {'name': 'algo.balancedTriads',\n",
       "  'signature': 'algo.balancedTriads(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (loadMillis :: INTEGER?, computeMillis :: INTEGER?, writeMillis :: INTEGER?, nodeCount :: INTEGER?, balancedTriadCount :: INTEGER?, unbalancedTriadCount :: INTEGER?)',\n",
       "  'description': \"CALL algo.balancedTriads(label, relationship{concurrency:4, write:true, weightProperty:'w', balancedProperty:'balanced', unbalancedProperty:'unbalanced'}) YIELD loadMillis, computeMillis, writeMillis, nodeCount, balancedTriadCount, unbalancedTriadCount\"},\n",
       " {'name': 'algo.balancedTriads.stream',\n",
       "  'signature': 'algo.balancedTriads.stream(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (nodeId :: INTEGER?, balanced :: INTEGER?, unbalanced :: INTEGER?)',\n",
       "  'description': 'CALL algo.balancedTriads.stream(label, relationship, {concurrency:8}) YIELD nodeId, balanced, unbalanced'},\n",
       " {'name': 'algo.betweenness',\n",
       "  'signature': 'algo.betweenness(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (loadMillis :: INTEGER?, computeMillis :: INTEGER?, writeMillis :: INTEGER?, nodes :: INTEGER?, minCentrality :: FLOAT?, maxCentrality :: FLOAT?, sumCentrality :: FLOAT?)',\n",
       "  'description': \"CALL algo.betweenness(label:String, relationship:String, {direction:'out',write:true, writeProperty:'centrality', stats:true, concurrency:4}) YIELD loadMillis, computeMillis, writeMillis, nodes, minCentrality, maxCentrality, sumCentrality - yields status of evaluation\"},\n",
       " {'name': 'algo.betweenness.sampled',\n",
       "  'signature': 'algo.betweenness.sampled(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (loadMillis :: INTEGER?, computeMillis :: INTEGER?, writeMillis :: INTEGER?, nodes :: INTEGER?, minCentrality :: FLOAT?, maxCentrality :: FLOAT?, sumCentrality :: FLOAT?)',\n",
       "  'description': \"CALL algo.betweenness.sampled(label:String, relationship:String, {strategy:'random', probability:double, maxDepth:5, direction:'out',write:true, writeProperty:'centrality', stats:true, concurrency:4}) YIELD loadMillis, computeMillis, writeMillis, nodes, minCentrality, maxCentrality, sumCentrality - yields status of evaluation\"},\n",
       " {'name': 'algo.betweenness.sampled.stream',\n",
       "  'signature': 'algo.betweenness.sampled.stream(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (nodeId :: INTEGER?, centrality :: FLOAT?)',\n",
       "  'description': \"CALL algo.betweenness.sampled.stream(label:String, relationship:String, {strategy:{'random', 'degree'}, probability:double, maxDepth:int, direction:String, concurrency:int}) YIELD nodeId, centrality - yields centrality for each node\"},\n",
       " {'name': 'algo.betweenness.stream',\n",
       "  'signature': 'algo.betweenness.stream(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (nodeId :: INTEGER?, centrality :: FLOAT?)',\n",
       "  'description': \"CALL algo.betweenness.stream(label:String, relationship:String, {direction:'out', concurrency :4})YIELD nodeId, centrality - yields centrality for each node\"},\n",
       " {'name': 'algo.closeness',\n",
       "  'signature': 'algo.closeness(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (loadMillis :: INTEGER?, computeMillis :: INTEGER?, writeMillis :: INTEGER?, nodes :: INTEGER?)',\n",
       "  'description': \"CALL algo.closeness(label:String, relationship:String, {write:true, writeProperty:'centrality, concurrency:4'}) YIELD loadMillis, computeMillis, writeMillis, nodes] - yields evaluation details\"},\n",
       " {'name': 'algo.closeness.dangalchev',\n",
       "  'signature': 'algo.closeness.dangalchev(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (loadMillis :: INTEGER?, computeMillis :: INTEGER?, writeMillis :: INTEGER?, nodes :: INTEGER?)',\n",
       "  'description': \"CALL algo.closeness.dangalchev(label:String, relationship:String, {write:true, writeProperty:'centrality, concurrency:4'}) YIELD loadMillis, computeMillis, writeMillis, nodes] - yields evaluation details\"},\n",
       " {'name': 'algo.closeness.dangalchev.stream',\n",
       "  'signature': 'algo.closeness.dangalchev.stream(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (nodeId :: INTEGER?, centrality :: FLOAT?)',\n",
       "  'description': 'CALL algo.closeness.dangalchev.stream(label:String, relationship:String{concurrency:4}) YIELD nodeId, centrality - yields centrality for each node'},\n",
       " {'name': 'algo.closeness.harmonic',\n",
       "  'signature': 'algo.closeness.harmonic(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (loadMillis :: INTEGER?, computeMillis :: INTEGER?, writeMillis :: INTEGER?, nodes :: INTEGER?)',\n",
       "  'description': \"CALL algo.closeness.harmonic(label:String, relationship:String, {write:true, writeProperty:'centrality, concurrency:4'}) YIELD loadMillis, computeMillis, writeMillis, nodes] - yields evaluation details\"},\n",
       " {'name': 'algo.closeness.harmonic.stream',\n",
       "  'signature': 'algo.closeness.harmonic.stream(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (nodeId :: INTEGER?, centrality :: FLOAT?)',\n",
       "  'description': 'CALL algo.closeness.harmonic.stream(label:String, relationship:String{concurrency:4}) YIELD nodeId, centrality - yields centrality for each node'},\n",
       " {'name': 'algo.closeness.stream',\n",
       "  'signature': 'algo.closeness.stream(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (nodeId :: INTEGER?, centrality :: FLOAT?)',\n",
       "  'description': 'CALL algo.closeness.stream(label:String, relationship:String{concurrency:4}) YIELD nodeId, centrality - yields centrality for each node'},\n",
       " {'name': 'algo.graph.info',\n",
       "  'signature': 'algo.graph.info(name :: STRING?) :: (name :: STRING?, type :: STRING?, exists :: BOOLEAN?, removed :: BOOLEAN?, nodes :: INTEGER?)',\n",
       "  'description': 'CALL algo.graph.info(name:String'},\n",
       " {'name': 'algo.graph.load',\n",
       "  'signature': 'algo.graph.load(name =  :: STRING?, label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (name :: STRING?, graph :: STRING?, direction :: STRING?, undirected :: BOOLEAN?, sorted :: BOOLEAN?, nodes :: INTEGER?, loadMillis :: INTEGER?, alreadyLoaded :: BOOLEAN?, nodeWeight :: STRING?, relationshipWeight :: STRING?, nodeProperty :: STRING?, loadNodes :: STRING?, loadRelationships :: STRING?)',\n",
       "  'description': \"CALL algo.graph.load(name:String, label:String, relationship:String{direction:'OUT/IN/BOTH', undirected:true/false, sorted:true/false, nodeProperty:'value', nodeWeight:'weight', relationshipWeight: 'weight', graph:'heavy/huge/cypher'}) YIELD nodes, relationships, loadMillis, computeMillis, writeMillis, write, nodeProperty, nodeWeight, relationshipWeight - load named graph\"},\n",
       " {'name': 'algo.graph.remove',\n",
       "  'signature': 'algo.graph.remove(name :: STRING?) :: (name :: STRING?, type :: STRING?, exists :: BOOLEAN?, removed :: BOOLEAN?, nodes :: INTEGER?)',\n",
       "  'description': 'CALL algo.graph.remove(name:String'},\n",
       " {'name': 'algo.kShortestPaths',\n",
       "  'signature': 'algo.kShortestPaths(startNode :: NODE?, endNode :: NODE?, k :: INTEGER?, propertyName :: STRING?, config = {} :: MAP?) :: (loadMillis :: INTEGER?, evalMillis :: INTEGER?, writeMillis :: INTEGER?, resultCount :: INTEGER?)',\n",
       "  'description': \"CALL algo.kShortestPaths(startNode:Node, endNode:Node, k:int, weightProperty:String{nodeQuery:'labelName', relationshipQuery:'relationshipName', direction:'OUT', defaultValue:1.0, maxDepth:42, write:'true', writePropertyPrefix:'PATH_'}) YIELD resultCount, loadMillis, evalMillis, writeMillis - yields resultCount, loadMillis, evalMillis, writeMillis\"},\n",
       " {'name': 'algo.kShortestPaths.stream',\n",
       "  'signature': 'algo.kShortestPaths.stream(startNode :: NODE?, endNode :: NODE?, k :: INTEGER?, propertyName :: STRING?, config = {} :: MAP?) :: (index :: INTEGER?, sourceNodeId :: INTEGER?, targetNodeId :: INTEGER?, nodeIds :: LIST? OF INTEGER?, costs :: LIST? OF FLOAT?, path :: PATH?)',\n",
       "  'description': \"CALL algo.kShortestPaths.stream(startNode:Node, endNode:Node, k:int, weightProperty:String{nodeQuery:'labelName', relationshipQuery:'relationshipName', direction:'OUT', defaultValue:1.0, maxDepth:42}) YIELD sourceNodeId, targetNodeId, nodeIds, costs\"},\n",
       " {'name': 'algo.labelPropagation',\n",
       "  'signature': 'algo.labelPropagation(label =  :: STRING?, relationship =  :: STRING?, direction = OUTGOING :: STRING?, config = {} :: MAP?) :: (nodes :: INTEGER?, iterations :: INTEGER?, loadMillis :: INTEGER?, computeMillis :: INTEGER?, writeMillis :: INTEGER?, write :: BOOLEAN?, didConverge :: BOOLEAN?, weightProperty :: STRING?, partitionProperty :: STRING?)',\n",
       "  'description': \"CALL algo.labelPropagation(label:String, relationship:String, direction:String, {iterations:1, weightProperty:'weight', partitionProperty:'partition', write:true, concurrency:4}) YIELD nodes, iterations, didConverge, loadMillis, computeMillis, writeMillis, write, weightProperty, partitionProperty - simple label propagation kernel\"},\n",
       " {'name': 'algo.labelPropagation.stream',\n",
       "  'signature': 'algo.labelPropagation.stream(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (nodeId :: INTEGER?, label :: INTEGER?)',\n",
       "  'description': 'CALL algo.labelPropagation.stream(label:String, relationship:String, config:Map<String, Object>) YIELD nodeId, label'},\n",
       " {'name': 'algo.list',\n",
       "  'signature': 'algo.list(name =  :: STRING?) :: (name :: STRING?, description :: STRING?, signature :: STRING?)',\n",
       "  'description': 'CALL algo.list - lists all algorithm procedures, their description and signature'},\n",
       " {'name': 'algo.louvain',\n",
       "  'signature': 'algo.louvain(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (loadMillis :: INTEGER?, computeMillis :: INTEGER?, writeMillis :: INTEGER?, nodes :: INTEGER?, iterations :: INTEGER?, communityCount :: INTEGER?)',\n",
       "  'description': \"CALL algo.louvain(label:String, relationship:String, {weightProperty:'weight', defaultValue:1.0, write: true, writeProperty:'community', concurrency:4, communityProperty:'propertyOfPredefinedCommunity'}) YIELD nodes, communityCount, iterations, loadMillis, computeMillis, writeMillis\"},\n",
       " {'name': 'algo.louvain.stream',\n",
       "  'signature': 'algo.louvain.stream(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (nodeId :: INTEGER?, communities :: LIST? OF INTEGER?, community :: INTEGER?)',\n",
       "  'description': \"CALL algo.louvain.stream(label:String, relationship:String, {weightProperty:'propertyName', defaultValue:1.0, concurrency:4, communityProperty:'propertyOfPredefinedCommunity') YIELD nodeId, community - yields a setId to each node id\"},\n",
       " {'name': 'algo.mst',\n",
       "  'signature': 'algo.mst(label :: STRING?, relationshipType :: STRING?, weightProperty :: STRING?, startNodeId :: INTEGER?, config = {} :: MAP?) :: (loadMillis :: INTEGER?, computeMillis :: INTEGER?, writeMillis :: INTEGER?, effectiveNodeCount :: INTEGER?)',\n",
       "  'description': 'CALL algo.mst(label:String, relationshipType:String, weightProperty:String, startNodeId:long, {writeProperty:String}) YIELD loadMillis, computeMillis, writeMillis, effectiveNodeCount'},\n",
       " {'name': 'algo.pageRank',\n",
       "  'signature': 'algo.pageRank(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (nodes :: INTEGER?, iterations :: INTEGER?, loadMillis :: INTEGER?, computeMillis :: INTEGER?, writeMillis :: INTEGER?, dampingFactor :: FLOAT?, write :: BOOLEAN?, writeProperty :: STRING?)',\n",
       "  'description': \"CALL algo.pageRank(label:String, relationship:String, {iterations:5, dampingFactor:0.85, weightProperty: null, write: true, writeProperty:'pagerank', concurrency:4}) YIELD nodes, iterations, loadMillis, computeMillis, writeMillis, dampingFactor, write, writeProperty - calculates page rank and potentially writes back\"},\n",
       " {'name': 'algo.pageRank.stream',\n",
       "  'signature': 'algo.pageRank.stream(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (nodeId :: INTEGER?, score :: FLOAT?)',\n",
       "  'description': 'CALL algo.pageRank.stream(label:String, relationship:String, {iterations:20, dampingFactor:0.85, weightProperty: null, concurrency:4}) YIELD node, score - calculates page rank and streams results'},\n",
       " {'name': 'algo.randomWalk.stream',\n",
       "  'signature': 'algo.randomWalk.stream(start = null :: ANY?, steps = 10 :: INTEGER?, walks = 1 :: INTEGER?, config = {} :: MAP?) :: (startNodeId :: INTEGER?, nodeIds :: LIST? OF INTEGER?, path :: PATH?)',\n",
       "  'description': \"CALL algo.randomWalk.stream(start:null=all/[ids]/label, steps, walks, {graph: 'heavy/cypher', nodeQuery:nodeLabel/query, relationshipQuery:relType/query, mode:random/node2vec, return:1.0, inOut:1.0, path:false/true concurrency:4, direction:'BOTH'}) YIELD nodes, path - computes random walks from given starting points\"},\n",
       " {'name': 'algo.scc',\n",
       "  'signature': 'algo.scc(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (loadMillis :: INTEGER?, computeMillis :: INTEGER?, writeMillis :: INTEGER?, setCount :: INTEGER?, minSetSize :: INTEGER?, maxSetSize :: INTEGER?)',\n",
       "  'description': 'CALL algo.scc(label:String, relationship:String, config:Map<String, Object>) YIELD loadMillis, computeMillis, writeMillis, setCount, maxSetSize, minSetSize'},\n",
       " {'name': 'algo.scc.forwardBackward.stream',\n",
       "  'signature': 'algo.scc.forwardBackward.stream(startNodeId = 0 :: INTEGER?, label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (nodeId :: INTEGER?)',\n",
       "  'description': 'CALL algo.scc.forwardBackward.stream(long startNodeId, label:String, relationship:String, {write:true, concurrency:4}) YIELD nodeId, partition'},\n",
       " {'name': 'algo.scc.iterative',\n",
       "  'signature': 'algo.scc.iterative(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (loadMillis :: INTEGER?, computeMillis :: INTEGER?, writeMillis :: INTEGER?, setCount :: INTEGER?, minSetSize :: INTEGER?, maxSetSize :: INTEGER?)',\n",
       "  'description': 'CALL algo.scc.iterative(label:String, relationship:String, config:Map<String, Object>) YIELD loadMillis, computeMillis, writeMillis, setCount, maxSetSize, minSetSize'},\n",
       " {'name': 'algo.scc.iterative.stream',\n",
       "  'signature': 'algo.scc.iterative.stream(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (nodeId :: INTEGER?, partition :: INTEGER?)',\n",
       "  'description': 'CALL algo.scc.iterative.stream(label:String, relationship:String, config:Map<String, Object>) YIELD nodeId, partition'},\n",
       " {'name': 'algo.scc.multistep',\n",
       "  'signature': 'algo.scc.multistep(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (loadMillis :: INTEGER?, computeMillis :: INTEGER?, writeMillis :: INTEGER?, setCount :: INTEGER?, minSetSize :: INTEGER?, maxSetSize :: INTEGER?)',\n",
       "  'description': 'CALL algo.scc.multistep(label:String, relationship:String, {write:true, concurrency:4, cutoff:100000}) YIELD loadMillis, computeMillis, writeMillis, setCount, maxSetSize, minSetSize'},\n",
       " {'name': 'algo.scc.multistep.stream',\n",
       "  'signature': 'algo.scc.multistep.stream(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (nodeId :: INTEGER?, partition :: INTEGER?)',\n",
       "  'description': 'CALL algo.scc.multistep.stream(label:String, relationship:String, {write:true, concurrency:4, cutoff:100000}) YIELD nodeId, partition'},\n",
       " {'name': 'algo.scc.recursive.tarjan',\n",
       "  'signature': 'algo.scc.recursive.tarjan(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (loadMillis :: INTEGER?, computeMillis :: INTEGER?, writeMillis :: INTEGER?, setCount :: INTEGER?, minSetSize :: INTEGER?, maxSetSize :: INTEGER?)',\n",
       "  'description': 'CALL algo.scc.tarjan(label:String, relationship:String, config:Map<String, Object>) YIELD loadMillis, computeMillis, writeMillis, setCount, maxSetSize, minSetSize'},\n",
       " {'name': 'algo.scc.recursive.tunedTarjan',\n",
       "  'signature': 'algo.scc.recursive.tunedTarjan(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (loadMillis :: INTEGER?, computeMillis :: INTEGER?, writeMillis :: INTEGER?, setCount :: INTEGER?, minSetSize :: INTEGER?, maxSetSize :: INTEGER?)',\n",
       "  'description': 'CALL algo.scc.recursive.tunedTarjan(label:String, relationship:String, config:Map<String, Object>) YIELD loadMillis, computeMillis, writeMillis, setCount, maxSetSize, minSetSize'},\n",
       " {'name': 'algo.scc.recursive.tunedTarjan.stream',\n",
       "  'signature': 'algo.scc.recursive.tunedTarjan.stream(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (nodeId :: INTEGER?, partition :: INTEGER?)',\n",
       "  'description': 'CALL algo.scc.recursive.tunedTarjan.stream(label:String, relationship:String, config:Map<String, Object>) YIELD nodeId, partition'},\n",
       " {'name': 'algo.scc.stream',\n",
       "  'signature': 'algo.scc.stream(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (nodeId :: INTEGER?, partition :: INTEGER?)',\n",
       "  'description': 'CALL algo.scc.stream(label:String, relationship:String, config:Map<String, Object>) YIELD loadMillis, computeMillis, writeMillis, setCount, maxSetSize, minSetSize'},\n",
       " {'name': 'algo.shortestPath',\n",
       "  'signature': 'algo.shortestPath(startNode :: NODE?, endNode :: NODE?, propertyName :: STRING?, config = {} :: MAP?) :: (loadMillis :: INTEGER?, evalMillis :: INTEGER?, writeMillis :: INTEGER?, nodeCount :: INTEGER?, totalCost :: FLOAT?)',\n",
       "  'description': \"CALL algo.shortestPath(startNode:Node, endNode:Node, weightProperty:String{nodeQuery:'labelName', relationshipQuery:'relationshipName', direction:'BOTH', defaultValue:1.0, write:'true', writeProperty:'sssp'}) YIELD nodeId, cost, loadMillis, evalMillis, writeMillis - yields nodeCount, totalCost, loadMillis, evalMillis, writeMillis\"},\n",
       " {'name': 'algo.shortestPath.astar.stream',\n",
       "  'signature': 'algo.shortestPath.astar.stream(startNode :: NODE?, endNode :: NODE?, propertyName :: STRING?, propertyKeyLat = latitude :: STRING?, propertyKeyLon = longitude :: STRING?, config = {} :: MAP?) :: (nodeId :: INTEGER?, cost :: FLOAT?)',\n",
       "  'description': \"CALL algo.shortestPath.astar.stream(startNode:Node, endNode:Node, weightProperty:String, propertyKeyLat:String,propertyKeyLon:String, {nodeQuery:'labelName', relationshipQuery:'relationshipName', direction:'BOTH', defaultValue:1.0}) YIELD nodeId, cost - yields a stream of {nodeId, cost} from start to end (inclusive)\"},\n",
       " {'name': 'algo.shortestPath.deltaStepping',\n",
       "  'signature': 'algo.shortestPath.deltaStepping(startNode :: NODE?, propertyName :: STRING?, delta :: FLOAT?, config = {} :: MAP?) :: (loadDuration :: INTEGER?, evalDuration :: INTEGER?, writeDuration :: INTEGER?, nodeCount :: INTEGER?)',\n",
       "  'description': \"CALL algo.shortestPath.deltaStepping(startNode:Node, weightProperty:String, delta:Double{label:'labelName', relationship:'relationshipName', defaultValue:1.0, write:true, writeProperty:'sssp'}) YIELD loadDuration, evalDuration, writeDuration, nodeCount\"},\n",
       " {'name': 'algo.shortestPath.deltaStepping.stream',\n",
       "  'signature': 'algo.shortestPath.deltaStepping.stream(startNode :: NODE?, propertyName :: STRING?, delta :: FLOAT?, config = {} :: MAP?) :: (nodeId :: INTEGER?, distance :: FLOAT?)',\n",
       "  'description': \"CALL algo.shortestPath.deltaStepping.stream(startNode:Node, weightProperty:String, delta:Double{label:'labelName', relationship:'relationshipName', defaultValue:1.0, concurrency:4}) YIELD nodeId, distance - yields a stream of {nodeId, distance} from start to end (inclusive)\"},\n",
       " {'name': 'algo.shortestPath.stream',\n",
       "  'signature': 'algo.shortestPath.stream(startNode :: NODE?, endNode :: NODE?, propertyName :: STRING?, config = {} :: MAP?) :: (nodeId :: INTEGER?, cost :: FLOAT?)',\n",
       "  'description': \"CALL algo.shortestPath.stream(startNode:Node, endNode:Node, weightProperty:String{nodeQuery:'labelName', relationshipQuery:'relationshipName', direction:'BOTH', defaultValue:1.0}) YIELD nodeId, cost - yields a stream of {nodeId, cost} from start to end (inclusive)\"},\n",
       " {'name': 'algo.shortestPaths',\n",
       "  'signature': 'algo.shortestPaths(startNode :: NODE?, propertyName :: STRING?, config = {} :: MAP?) :: (loadDuration :: INTEGER?, evalDuration :: INTEGER?, writeDuration :: INTEGER?, nodeCount :: INTEGER?, targetProperty :: STRING?)',\n",
       "  'description': \"CALL algo.shortestPaths(startNode:Node, weightProperty:String{write:true, targetProperty:'path', nodeQuery:'labelName', relationshipQuery:'relationshipName', defaultValue:1.0}) YIELD loadDuration, evalDuration, writeDuration, nodeCount, targetProperty - yields nodeCount, totalCost, loadDuration, evalDuration\"},\n",
       " {'name': 'algo.shortestPaths.stream',\n",
       "  'signature': 'algo.shortestPaths.stream(startNode :: NODE?, propertyName :: STRING?, config = {} :: MAP?) :: (nodeId :: INTEGER?, distance :: FLOAT?)',\n",
       "  'description': \"CALL algo.shortestPaths.stream(startNode:Node, weightProperty:String{nodeQuery:'labelName', relationshipQuery:'relationshipName', defaultValue:1.0}) YIELD nodeId, distance - yields a stream of {nodeId, cost} from start to end (inclusive)\"},\n",
       " {'name': 'algo.similarity.cosine',\n",
       "  'signature': 'algo.similarity.cosine(data = null :: ANY?, config = {} :: MAP?) :: (nodes :: INTEGER?, similarityPairs :: INTEGER?, write :: BOOLEAN?, writeRelationshipType :: STRING?, writeProperty :: STRING?, min :: FLOAT?, max :: FLOAT?, mean :: FLOAT?, stdDev :: FLOAT?, p25 :: FLOAT?, p50 :: FLOAT?, p75 :: FLOAT?, p90 :: FLOAT?, p95 :: FLOAT?, p99 :: FLOAT?, p999 :: FLOAT?, p100 :: FLOAT?)',\n",
       "  'description': 'CALL algo.similarity.cosine([{item:id, weights:[weights]}], {similarityCutoff:-1,degreeCutoff:0}) YIELD p50, p75, p90, p99, p999, p100 - computes cosine similarities'},\n",
       " {'name': 'algo.similarity.cosine.stream',\n",
       "  'signature': 'algo.similarity.cosine.stream(data = null :: ANY?, config = {} :: MAP?) :: (item2 :: INTEGER?, count1 :: INTEGER?, item1 :: INTEGER?, count2 :: INTEGER?, intersection :: INTEGER?, similarity :: FLOAT?, bidirectional :: BOOLEAN?, reversed :: BOOLEAN?)',\n",
       "  'description': 'CALL algo.similarity.cosine.stream([{item:id, weights:[weights]}], {similarityCutoff:-1,degreeCutoff:0}) YIELD item1, item2, count1, count2, intersection, similarity - computes cosine distance'},\n",
       " {'name': 'algo.similarity.euclidean',\n",
       "  'signature': 'algo.similarity.euclidean(data = null :: ANY?, config = {} :: MAP?) :: (nodes :: INTEGER?, similarityPairs :: INTEGER?, write :: BOOLEAN?, writeRelationshipType :: STRING?, writeProperty :: STRING?, min :: FLOAT?, max :: FLOAT?, mean :: FLOAT?, stdDev :: FLOAT?, p25 :: FLOAT?, p50 :: FLOAT?, p75 :: FLOAT?, p90 :: FLOAT?, p95 :: FLOAT?, p99 :: FLOAT?, p999 :: FLOAT?, p100 :: FLOAT?)',\n",
       "  'description': 'CALL algo.similarity.euclidean([{item:id, weights:[weights]}], {similarityCutoff:-1,degreeCutoff:0}) YIELD p50, p75, p90, p99, p999, p100 - computes euclidean similarities'},\n",
       " {'name': 'algo.similarity.euclidean.stream',\n",
       "  'signature': 'algo.similarity.euclidean.stream(data = null :: ANY?, config = {} :: MAP?) :: (item2 :: INTEGER?, count1 :: INTEGER?, item1 :: INTEGER?, count2 :: INTEGER?, intersection :: INTEGER?, similarity :: FLOAT?, bidirectional :: BOOLEAN?, reversed :: BOOLEAN?)',\n",
       "  'description': 'CALL algo.similarity.euclidean.stream([{item:id, weights:[weights]}], {similarityCutoff:-1,degreeCutoff:0}) YIELD item1, item2, count1, count2, intersection, similarity - computes euclidean distance'},\n",
       " {'name': 'algo.similarity.jaccard',\n",
       "  'signature': 'algo.similarity.jaccard(data = null :: LIST? OF MAP?, config = {} :: MAP?) :: (nodes :: INTEGER?, similarityPairs :: INTEGER?, write :: BOOLEAN?, writeRelationshipType :: STRING?, writeProperty :: STRING?, min :: FLOAT?, max :: FLOAT?, mean :: FLOAT?, stdDev :: FLOAT?, p25 :: FLOAT?, p50 :: FLOAT?, p75 :: FLOAT?, p90 :: FLOAT?, p95 :: FLOAT?, p99 :: FLOAT?, p999 :: FLOAT?, p100 :: FLOAT?)',\n",
       "  'description': 'CALL algo.similarity.jaccard([{item:id, categories:[ids]}], {similarityCutoff:-1,degreeCutoff:0}) YIELD p50, p75, p90, p99, p999, p100 - computes jaccard similarities'},\n",
       " {'name': 'algo.similarity.jaccard.stream',\n",
       "  'signature': 'algo.similarity.jaccard.stream(data = null :: LIST? OF MAP?, config = {} :: MAP?) :: (item2 :: INTEGER?, count1 :: INTEGER?, item1 :: INTEGER?, count2 :: INTEGER?, intersection :: INTEGER?, similarity :: FLOAT?, bidirectional :: BOOLEAN?, reversed :: BOOLEAN?)',\n",
       "  'description': 'CALL algo.similarity.jaccard.stream([{item:id, categories:[ids]}], {similarityCutoff:-1,degreeCutoff:0}) YIELD item1, item2, count1, count2, intersection, similarity - computes jaccard similarities'},\n",
       " {'name': 'algo.similarity.overlap',\n",
       "  'signature': 'algo.similarity.overlap(data = null :: LIST? OF MAP?, config = {} :: MAP?) :: (nodes :: INTEGER?, similarityPairs :: INTEGER?, write :: BOOLEAN?, writeRelationshipType :: STRING?, writeProperty :: STRING?, min :: FLOAT?, max :: FLOAT?, mean :: FLOAT?, stdDev :: FLOAT?, p25 :: FLOAT?, p50 :: FLOAT?, p75 :: FLOAT?, p90 :: FLOAT?, p95 :: FLOAT?, p99 :: FLOAT?, p999 :: FLOAT?, p100 :: FLOAT?)',\n",
       "  'description': 'CALL algo.similarity.overlap([{item:id, targets:[ids]}], {similarityCutoff:-1,degreeCutoff:0}) YIELD p50, p75, p90, p99, p999, p100 - computes overlap similarities'},\n",
       " {'name': 'algo.similarity.overlap.stream',\n",
       "  'signature': 'algo.similarity.overlap.stream(data = null :: LIST? OF MAP?, config = {} :: MAP?) :: (item2 :: INTEGER?, count1 :: INTEGER?, item1 :: INTEGER?, count2 :: INTEGER?, intersection :: INTEGER?, similarity :: FLOAT?, bidirectional :: BOOLEAN?, reversed :: BOOLEAN?)',\n",
       "  'description': 'CALL algo.similarity.overlap.stream([{item:id, targets:[ids]}], {similarityCutoff:-1,degreeCutoff:0}) YIELD item1, item2, count1, count2, intersection, similarity - computes overlap similarities'},\n",
       " {'name': 'algo.similarity.pearson',\n",
       "  'signature': 'algo.similarity.pearson(data = null :: ANY?, config = {} :: MAP?) :: (nodes :: INTEGER?, similarityPairs :: INTEGER?, write :: BOOLEAN?, writeRelationshipType :: STRING?, writeProperty :: STRING?, min :: FLOAT?, max :: FLOAT?, mean :: FLOAT?, stdDev :: FLOAT?, p25 :: FLOAT?, p50 :: FLOAT?, p75 :: FLOAT?, p90 :: FLOAT?, p95 :: FLOAT?, p99 :: FLOAT?, p999 :: FLOAT?, p100 :: FLOAT?)',\n",
       "  'description': 'CALL algo.similarity.pearson([{item:id, weights:[weights]}], {similarityCutoff:-1,degreeCutoff:0}) YIELD p50, p75, p90, p99, p999, p100 - computes cosine similarities'},\n",
       " {'name': 'algo.similarity.pearson.stream',\n",
       "  'signature': 'algo.similarity.pearson.stream(data = null :: ANY?, config = {} :: MAP?) :: (item2 :: INTEGER?, count1 :: INTEGER?, item1 :: INTEGER?, count2 :: INTEGER?, intersection :: INTEGER?, similarity :: FLOAT?, bidirectional :: BOOLEAN?, reversed :: BOOLEAN?)',\n",
       "  'description': 'CALL algo.similarity.pearson.stream([{item:id, weights:[weights]}], {similarityCutoff:-1,degreeCutoff:0}) YIELD item1, item2, count1, count2, intersection, similarity - computes cosine distance'},\n",
       " {'name': 'algo.spanningTree',\n",
       "  'signature': 'algo.spanningTree(label :: STRING?, relationshipType :: STRING?, weightProperty :: STRING?, startNodeId :: INTEGER?, config = {} :: MAP?) :: (loadMillis :: INTEGER?, computeMillis :: INTEGER?, writeMillis :: INTEGER?, effectiveNodeCount :: INTEGER?)',\n",
       "  'description': 'CALL algo.spanningTree(label:String, relationshipType:String, weightProperty:String, startNodeId:long, {writeProperty:String}) YIELD loadMillis, computeMillis, writeMillis, effectiveNodeCount'},\n",
       " {'name': 'algo.spanningTree.kmax',\n",
       "  'signature': 'algo.spanningTree.kmax(label :: STRING?, relationshipType :: STRING?, weightProperty :: STRING?, startNodeId :: INTEGER?, k :: INTEGER?, config = {} :: MAP?) :: (loadMillis :: INTEGER?, computeMillis :: INTEGER?, writeMillis :: INTEGER?, effectiveNodeCount :: INTEGER?)',\n",
       "  'description': 'CALL algo.spanningTree.kmax(label:String, relationshipType:String, weightProperty:String, startNodeId:long, k:int, {writeProperty:String}) YIELD loadMillis, computeMillis, writeMillis, effectiveNodeCount'},\n",
       " {'name': 'algo.spanningTree.kmin',\n",
       "  'signature': 'algo.spanningTree.kmin(label :: STRING?, relationshipType :: STRING?, weightProperty :: STRING?, startNodeId :: INTEGER?, k :: INTEGER?, config = {} :: MAP?) :: (loadMillis :: INTEGER?, computeMillis :: INTEGER?, writeMillis :: INTEGER?, effectiveNodeCount :: INTEGER?)',\n",
       "  'description': 'CALL algo.spanningTree.kmin(label:String, relationshipType:String, weightProperty:String, startNodeId:long, k:int, {writeProperty:String}) YIELD loadMillis, computeMillis, writeMillis, effectiveNodeCount'},\n",
       " {'name': 'algo.spanningTree.maximum',\n",
       "  'signature': 'algo.spanningTree.maximum(label :: STRING?, relationshipType :: STRING?, weightProperty :: STRING?, startNodeId :: INTEGER?, config = {} :: MAP?) :: (loadMillis :: INTEGER?, computeMillis :: INTEGER?, writeMillis :: INTEGER?, effectiveNodeCount :: INTEGER?)',\n",
       "  'description': 'CALL algo.spanningTree.maximum(label:String, relationshipType:String, weightProperty:String, startNodeId:long, {writeProperty:String}) YIELD loadMillis, computeMillis, writeMillis, effectiveNodeCount'},\n",
       " {'name': 'algo.spanningTree.minimum',\n",
       "  'signature': 'algo.spanningTree.minimum(label :: STRING?, relationshipType :: STRING?, weightProperty :: STRING?, startNodeId :: INTEGER?, config = {} :: MAP?) :: (loadMillis :: INTEGER?, computeMillis :: INTEGER?, writeMillis :: INTEGER?, effectiveNodeCount :: INTEGER?)',\n",
       "  'description': 'CALL algo.spanningTree.minimum(label:String, relationshipType:String, weightProperty:String, startNodeId:long, {writeProperty:String}) YIELD loadMillis, computeMillis, writeMillis, effectiveNodeCount'},\n",
       " {'name': 'algo.triangle.stream',\n",
       "  'signature': 'algo.triangle.stream(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (nodeA :: INTEGER?, nodeB :: INTEGER?, nodeC :: INTEGER?)',\n",
       "  'description': 'CALL algo.triangle.stream(label, relationship, {concurrency:4}) YIELD nodeA, nodeB, nodeC - yield nodeA, nodeB and nodeC which form a triangle'},\n",
       " {'name': 'algo.triangleCount',\n",
       "  'signature': 'algo.triangleCount(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (loadMillis :: INTEGER?, computeMillis :: INTEGER?, writeMillis :: INTEGER?, nodeCount :: INTEGER?, triangleCount :: INTEGER?, averageClusteringCoefficient :: FLOAT?)',\n",
       "  'description': \"CALL algo.triangleCount(label, relationship, {concurrency:4, write:true, writeProperty:'triangles', clusteringCoefficientProperty:'coefficient'}) YIELD loadMillis, computeMillis, writeMillis, nodeCount, triangleCount, averageClusteringCoefficient\"},\n",
       " {'name': 'algo.triangleCount.forkJoin',\n",
       "  'signature': 'algo.triangleCount.forkJoin(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (loadMillis :: INTEGER?, computeMillis :: INTEGER?, writeMillis :: INTEGER?, nodeCount :: INTEGER?, triangleCount :: INTEGER?, averageClusteringCoefficient :: FLOAT?)',\n",
       "  'description': \"CALL algo.triangleCount.forkJoin(label, relationship, {concurrency:4, write:true, writeProperty:'triangles', clusteringCoefficientProperty:'coefficient'}) YIELD loadMillis, computeMillis, writeMillis, nodeCount, triangleCount, averageClusteringCoefficient\"},\n",
       " {'name': 'algo.triangleCount.forkJoin.stream',\n",
       "  'signature': 'algo.triangleCount.forkJoin.stream(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (nodeId :: INTEGER?, triangles :: INTEGER?, coefficient :: FLOAT?)',\n",
       "  'description': 'CALL algo.triangleCount.forkJoin.stream(label, relationship, {concurrency:8}) YIELD nodeId, triangles - yield nodeId, number of triangles'},\n",
       " {'name': 'algo.triangleCount.stream',\n",
       "  'signature': 'algo.triangleCount.stream(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (nodeId :: INTEGER?, triangles :: INTEGER?, coefficient :: FLOAT?)',\n",
       "  'description': 'CALL algo.triangleCount.stream(label, relationship, {concurrency:8}) YIELD nodeId, triangles - yield nodeId, number of triangles'},\n",
       " {'name': 'algo.unionFind',\n",
       "  'signature': 'algo.unionFind(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (loadMillis :: INTEGER?, computeMillis :: INTEGER?, writeMillis :: INTEGER?, nodes :: INTEGER?, setCount :: INTEGER?)',\n",
       "  'description': \"CALL algo.unionFind(label:String, relationship:String, {weightProperty:'weight', threshold:0.42, defaultValue:1.0, write: true, partitionProperty:'partition'}) YIELD nodes, setCount, loadMillis, computeMillis, writeMillis\"},\n",
       " {'name': 'algo.unionFind.forkJoin',\n",
       "  'signature': 'algo.unionFind.forkJoin(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (loadMillis :: INTEGER?, computeMillis :: INTEGER?, writeMillis :: INTEGER?, nodes :: INTEGER?, setCount :: INTEGER?)',\n",
       "  'description': \"CALL algo.unionFind(label:String, relationship:String, {property:'weight', threshold:0.42, defaultValue:1.0, write: true, partitionProperty:'partition',concurrency:4}) YIELD nodes, setCount, loadMillis, computeMillis, writeMillis\"},\n",
       " {'name': 'algo.unionFind.forkJoin.stream',\n",
       "  'signature': 'algo.unionFind.forkJoin.stream(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (nodeId :: INTEGER?, setId :: INTEGER?)',\n",
       "  'description': \"CALL algo.unionFind.stream(label:String, relationship:String, {property:'propertyName', threshold:0.42, defaultValue:1.0,concurrency:4}) YIELD nodeId, setId - yields a setId to each node id\"},\n",
       " {'name': 'algo.unionFind.forkJoinMerge',\n",
       "  'signature': 'algo.unionFind.forkJoinMerge(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (loadMillis :: INTEGER?, computeMillis :: INTEGER?, writeMillis :: INTEGER?, nodes :: INTEGER?, setCount :: INTEGER?)',\n",
       "  'description': \"CALL algo.unionFind(label:String, relationship:String, {property:'weight', threshold:0.42, defaultValue:1.0, write: true, partitionProperty:'partition', concurrency:4}) YIELD nodes, setCount, loadMillis, computeMillis, writeMillis\"},\n",
       " {'name': 'algo.unionFind.forkJoinMerge.stream',\n",
       "  'signature': 'algo.unionFind.forkJoinMerge.stream(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (nodeId :: INTEGER?, setId :: INTEGER?)',\n",
       "  'description': \"CALL algo.unionFind.stream(label:String, relationship:String, {property:'propertyName', threshold:0.42, defaultValue:1.0, concurrency:4}) YIELD nodeId, setId - yields a setId to each node id\"},\n",
       " {'name': 'algo.unionFind.mscoloring',\n",
       "  'signature': 'algo.unionFind.mscoloring(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (loadMillis :: INTEGER?, computeMillis :: INTEGER?, writeMillis :: INTEGER?, nodes :: INTEGER?, setCount :: INTEGER?)',\n",
       "  'description': \"CALL algo.unionFind.mscoloring(label:String, relationship:String, {property:'weight', threshold:0.42, defaultValue:1.0, write: true, partitionProperty:'partition', concurrency:4}) YIELD nodes, setCount, loadMillis, computeMillis, writeMillis\"},\n",
       " {'name': 'algo.unionFind.mscoloring.stream',\n",
       "  'signature': 'algo.unionFind.mscoloring.stream(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (nodeId :: INTEGER?, color :: INTEGER?)',\n",
       "  'description': \"CALL algo.unionFind.mscoloring.stream(label:String, relationship:String, {property:'propertyName', threshold:0.42, defaultValue:1.0, concurrency:4) YIELD nodeId, setId - yields a setId to each node id\"},\n",
       " {'name': 'algo.unionFind.queue',\n",
       "  'signature': 'algo.unionFind.queue(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (loadMillis :: INTEGER?, computeMillis :: INTEGER?, writeMillis :: INTEGER?, nodes :: INTEGER?, setCount :: INTEGER?)',\n",
       "  'description': \"CALL algo.unionFind(label:String, relationship:String, {property:'weight', threshold:0.42, defaultValue:1.0, write: true, partitionProperty:'partition',concurrency:4}) YIELD nodes, setCount, loadMillis, computeMillis, writeMillis\"},\n",
       " {'name': 'algo.unionFind.queue.stream',\n",
       "  'signature': 'algo.unionFind.queue.stream(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (nodeId :: INTEGER?, setId :: INTEGER?)',\n",
       "  'description': \"CALL algo.unionFind.stream(label:String, relationship:String, {property:'propertyName', threshold:0.42, defaultValue:1.0, concurrency:4}) YIELD nodeId, setId - yields a setId to each node id\"},\n",
       " {'name': 'algo.unionFind.stream',\n",
       "  'signature': 'algo.unionFind.stream(label =  :: STRING?, relationship =  :: STRING?, config = {} :: MAP?) :: (nodeId :: INTEGER?, setId :: INTEGER?)',\n",
       "  'description': \"CALL algo.unionFind.stream(label:String, relationship:String, {weightProperty:'propertyName', threshold:0.42, defaultValue:1.0) YIELD nodeId, setId - yields a setId to each node id\"}]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cur = graph.run(\"\"\"CALL dbms.procedures() YIELD name, signature, description\n",
    "WHERE name starts with \"algo\"\n",
    "RETURN name, signature, description\"\"\")\n",
    "yield_results(cur).next()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "cur = graph.run(\"\"\"CALL dbms.procedures() YIELD name, signature, description\n",
    "WHERE name starts with \"apoc\"\n",
    "RETURN name, signature, description\"\"\")\n",
    "yield_results(cur).next()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
